package com.tapbi.spark.yokey.data.model;

import com.android.inputmethod.latin.settings.Settings;
import com.tapbi.spark.yokey.App;
import com.tapbi.spark.yokey.util.Constant;

public class Font {


    public String removeFont(String word) {
        StringBuilder result = new StringBuilder("");
        if (!word.isEmpty() && !(App.getInstance().mPrefs.getString(Constant.USING_FONT, Constant.FONT_NORMAL).equals(Constant.FONT_NORMAL))) {

            CharSequence[] fonts = App.getInstance().fontRepository.charSequences;
            CharSequence[] fontsNormal = getFont(Constant.FONT_NORMAL);
            if (fonts != null && fonts.length > 0) {
                for (int i = 0; i < word.length(); i++) {
                    String text = String.valueOf(word.charAt(i));
                    for (int j = 0; j < fonts.length; j++) {
                        if (text.equals(" ")){
                            result.append(" ");
                            break;
                        }else if (fontsNormal.length > j && text.equals(fonts[j])){
                            result.append((String) fontsNormal[j]);
                            break;
                        }else if (fontsNormal.length > j && text.equals(fontsNormal[j])){
                            result.append((String) fontsNormal[j]);
                            break;
                        }
                    }
                }
            }

        }else {
            return word;
        }
        return result.toString();
    }


    public CharSequence[] getFont(String nameFont) {
        if (nameFont == null || nameFont.equals(Constant.FONT_NORMAL)) {
            return new CharSequence[]{"a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v",
                    "w", "x", "y", "z", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V",
                    "W", "X", "Y", "Z"};
        } else if (nameFont.equals(Constant.FONT_ARROWS)) {
            return new CharSequence[]{"a͎", "b͎", "c͎", "d͎", "e͎", "f͎", "g͎", "h͎", "i͎", "j͎", "k͎", "l͎", "m͎", "n͎", "o͎", "p͎", "q͎", "r͎",
                    "s͎", "t͎", "u͎", "v͎", "w͎", "x͎", "y͎", "z͎", "A͎", "B͎", "C͎", "D͎", "E͎", "F͎", "G͎", "H͎", "I͎", "J͎", "K͎", "L͎", "M͎",
                    "N͎", "O͎", "P͎", "Q͎", "R͎", "S͎", "T͎", "U͎", "V͎", "W͎", "X͎", "Y͎", "Z͎", "͎"};
        } else if (nameFont.equals(Constant.FONT_BIRDS)) {
            return new CharSequence[]{"a҈", "b҈", "c҈", "d҈", "e҈", "f҈", "g҈", "h҈", "i҈", "j҈", "k҈", "l҈", "m҈", "n҈", "o҈", "p҈", "q҈", "r҈",
                    "s҈", "t҈", "u҈", "v҈", "w҈", "x҈", "y҈", "z҈", "A҈", "B҈", "C҈", "D҈", "E҈", "F҈", "G҈", "H҈", "I҈", "J҈", "K҈", "L҈", "M҈",
                    "N҈", "O҈", "P҈", "Q҈", "R҈", "S҈", "T҈", "U҈", "V҈", "W҈", "X҈", "Y҈", "Z҈", "҈"};
        } else if (nameFont.equals(Constant.FONT_BUBBLES)) {
            return new CharSequence[]{"ḁͦ", "b̥ͦ", "c̥ͦ", "d̥ͦ", "e̥ͦ", "f̥ͦ", "g̥ͦ", "h̥ͦ", "i̥ͦ", "j̥ͦ", "k̥ͦ", "l̥ͦ", "m̥ͦ", "n̥ͦ", "o̥ͦ", "p̥ͦ",
                    "q̥ͦ", "r̥ͦ", "s̥ͦ", "t̥ͦ", "u̥ͦ", "v̥ͦ", "w̥ͦ", "x̥ͦ", "y̥ͦ", "z̥ͦ", "Ḁͦ", "B̥ͦ", "C̥ͦ", "D̥ͦ", "E̥ͦ", "F̥ͦ", "G̥ͦ", "H̥ͦ",
                    "I̥ͦ", "J̥ͦ", "K̥ͦ", "L̥ͦ", "M̥ͦ", "N̥ͦ", "O̥ͦ", "P̥ͦ", "Q̥ͦ", "R̥ͦ", "S̥ͦ", "T̥ͦ", "U̥ͦ", "V̥ͦ", "W̥ͦ", "X̥ͦ", "Y̥ͦ", "Z̥ͦ",
                    "̥ͦ"};
        } else if (nameFont.equals(Constant.FONT_CIRCLES_FILLED)) {
            return new CharSequence[]{"🅐︎", "🅑︎", "🅒︎", "🅓︎", "🅔︎", "🅕︎", "🅖︎", "🅗︎", "🅘︎", "🅙︎", "🅚︎", "🅛︎", "🅜︎", "🅝︎", "🅞︎", "🅟︎",
                    "🅠︎", "🅡︎", "🅢︎", "🅣︎", "🅤︎", "🅥︎", "🅦︎", "🅧︎", "🅨︎", "🅩︎", "🅐︎", "🅑︎", "🅒︎", "🅓︎", "🅔︎", "🅕︎", "🅖︎", "🅗︎",
                    "🅘︎", "🅙︎", "🅚︎", "🅛︎", "🅜︎", "🅝︎", "🅞︎", "🅟︎", "🅠︎", "🅡︎", "🅢︎", "🅣︎", "🅤︎", "🅥︎", "🅦︎", "🅧︎", "🅨︎", "🅩︎"};
        } else if (nameFont.equals(Constant.FONT_CIRCLES_OUTLINE)) {
            return new CharSequence[]{"Ⓐ︎", "Ⓑ︎", "Ⓒ︎", "Ⓓ︎", "Ⓔ︎", "Ⓕ︎", "Ⓖ︎", "Ⓗ︎", "Ⓘ︎", "Ⓙ︎", "Ⓚ︎", "Ⓛ︎", "Ⓜ︎", "Ⓝ︎", "Ⓞ︎", "Ⓟ︎", "Ⓠ︎", "Ⓡ︎",
                    "Ⓢ︎", "Ⓣ︎", "Ⓤ︎", "Ⓥ︎", "Ⓦ︎", "Ⓧ︎", "Ⓨ︎", "Ⓩ︎", "Ⓐ︎", "Ⓑ︎", "Ⓒ︎", "Ⓓ︎", "Ⓔ︎", "Ⓕ︎", "Ⓖ︎", "Ⓗ︎", "Ⓘ︎", "Ⓙ︎", "Ⓚ︎", "Ⓛ︎", "Ⓜ︎",
                    "Ⓝ︎", "Ⓞ︎", "Ⓟ︎", "Ⓠ︎", "Ⓡ︎", "Ⓢ︎", "Ⓣ︎", "Ⓤ︎", "Ⓥ︎", "Ⓦ︎", "Ⓧ︎", "Ⓨ︎", "Ⓩ︎"};
        } else if (nameFont.equals(Constant.FONT_CLOUDS)) {
            return new CharSequence[]{"a͜͡", "b͜͡", "c͜͡", "d͜͡", "e͜͡", "f͜͡", "g͜͡", "h͜͡", "i͜͡", "j͜͡", "k͜͡", "l͜͡", "m͜͡", "n͜͡", "o͜͡", "p͜͡",
                    "q͜͡", "r͜͡", "s͜͡", "t͜͡", "u͜͡", "v͜͡", "w͜͡", "x͜͡", "y͜͡", "z͜͡", "A͜͡", "B͜͡", "C͜͡", "D͜͡", "E͜͡", "F͜͡", "G͜͡", "H͜͡",
                    "I͜͡", "J͜͡", "K͜͡", "L͜͡", "M͜͡", "N͜͡", "O͜͡", "P͜͡", "Q͜͡", "R͜͡", "S͜͡", "T͜͡", "U͜͡", "V͜͡", "W͜͡", "X͜͡", "Y͜͡", "Z͜͡",
                    "͜͡"};
        } else if (nameFont.equals(Constant.FONT_GOTHIC)) {
            return new CharSequence[]{"𝔞", "𝔟", "𝔠", "𝔡", "𝔢", "𝔣", "𝔤", "𝔥", "𝔦", "𝔧", "𝔨", "𝔩", "𝔪", "𝔫", "𝔬", "𝔭", "𝔮", "𝔯",
                    "𝔰", "𝔱", "𝔲", "𝔳", "𝔴", "𝔵", "𝔶", "𝔷", "𝔄", "𝔅", "ℭ", "𝔇", "𝔈", "𝔉", "𝔊", "ℌ", "ℑ", "𝔍", "𝔎", "𝔏", "𝔐", "𝔑",
                    "𝔒", "𝔓", "𝔔", "ℜ", "𝔖", "𝔗", "𝔘", "𝔙", "𝔚", "𝔛", "𝔜", "ℨ"};
        } else if (nameFont.equals(Constant.FONT_GOTHIC_BOLD)) {
            return new CharSequence[]{"𝖆", "𝖇", "𝖈", "𝖉", "𝖊", "𝖋", "𝖌", "𝖍", "𝖎", "𝖏", "𝖐", "𝖑", "𝖒", "𝖓", "𝖔", "𝖕", "𝖖", "𝖗",
                    "𝖘", "𝖙", "𝖚", "𝖛", "𝖜", "𝖝", "𝖞", "𝖟", "𝕬", "𝕭", "𝕮", "𝕯", "𝕰", "𝕱", "𝕲", "𝕳", "𝕴", "𝕵", "𝕶", "𝕷", "𝕸",
                    "𝕹", "𝕺", "𝕻", "𝕼", "𝕽", "𝕾", "𝕿", "𝖀", "𝖁", "𝖂", "𝖃", "𝖄", "𝖅"};
        } else if (nameFont.equals(Constant.FONT_HAPPY)) {
            return new CharSequence[]{"ă̈", "b̆̈", "c̆̈", "d̆̈", "ĕ̈", "f̆̈", "ğ̈", "h̆̈", "ĭ̈", "j̆̈", "k̆̈", "l̆̈", "m̆̈", "n̆̈", "ŏ̈", "p̆̈",
                    "q̆̈", "r̆̈", "s̆̈", "t̆̈", "ŭ̈", "v̆̈", "w̆̈", "x̆̈", "y̆̈", "z̆̈", "Ă̈", "B̆̈", "C̆̈", "D̆̈", "Ĕ̈", "F̆̈", "Ğ̈", "H̆̈",
                    "Ĭ̈", "J̆̈", "K̆̈", "L̆̈", "M̆̈", "N̆̈", "Ŏ̈", "P̆̈", "Q̆̈", "R̆̈", "S̆̈", "T̆̈", "Ŭ̈", "V̆̈", "W̆̈", "X̆̈", "Y̆̈", "Z̆̈",
                    "̆̈"};
        } else if (nameFont.equals(Constant.FONT_MANGA)) {
            return new CharSequence[]{"卂", "乃", "匚", "ᗪ", "乇", "千", "ᘜ", "卄", "|", "ﾌ", "Ҝ", "ㄥ", "爪", "几", "ㄖ", "卩", "Ҩ", "尺", "丂", "ㄒ", "ㄩ", "ᐯ",
                    "山", "乂", "ㄚ", "乙", "卂", "乃", "匚", "ᗪ", "乇", "千", "ᘜ", "卄", "|", "ﾌ", "Ҝ", "ㄥ", "爪", "几", "ㄖ", "卩", "Ҩ", "尺", "丂", "ㄒ", "ㄩ", "ᐯ",
                    "山", "乂", "ㄚ", "乙"};
        } else if (nameFont.equals(Constant.FONT_OUTLINE)) {
            return new CharSequence[]{"𝕒", "𝕓", "𝕔", "𝕕", "𝕖", "𝕗", "𝕘", "𝕙", "𝕚", "𝕛", "𝕜", "𝕝", "𝕞", "𝕟", "𝕠", "𝕡", "𝕢", "𝕣",
                    "𝕤", "𝕥", "𝕦", "𝕧", "𝕨", "𝕩", "𝕪", "𝕫", "𝔸", "𝔹", "ℂ", "𝔻", "𝔼", "𝔽", "𝔾", "ℍ", "𝕀", "𝕁", "𝕂", "𝕃", "𝕄", "ℕ",
                    "𝕆", "ℙ", "ℚ", "ℝ", "𝕊", "𝕋", "𝕌", "𝕍", "𝕎", "𝕏", "𝕐", "ℤ"};
        } else if (nameFont.equals(Constant.FONT_RAY)) {
            return new CharSequence[]{"a҉", "b҉", "c҉", "d҉", "e҉", "f҉", "g҉", "h҉", "i҉", "j҉", "k҉", "l҉", "m҉", "n҉", "o҉", "p҉", "q҉", "r҉",
                    "s҉", "t҉", "u҉", "v҉", "w҉", "x҉", "y҉", "z҉", "A҉", "B҉", "C҉", "D҉", "E҉", "F҉", "G҉", "H҉", "I҉", "J҉", "K҉", "L҉", "M҉",
                    "N҉", "O҉", "P҉", "Q҉", "R҉", "S҉", "T҉", "U҉", "V҉", "W҉", "X҉", "Y҉", "Z҉", "҉"};
        } else if (nameFont.equals(Constant.FONT_SAD)) {
            return new CharSequence[]{"ȃ̈", "b̑̈", "c̑̈", "d̑̈", "ȇ̈", "f̑̈", "g̑̈", "h̑̈", "ȋ̈", "j̑̈", "k̑̈", "l̑̈", "m̑̈", "n̑̈", "ȏ̈", "p̑̈",
                    "q̑̈", "ȓ̈", "s̑̈", "t̑̈", "ȗ̈", "v̑̈", "w̑̈", "x̑̈", "y̑̈", "z̑̈", "Ȃ̈", "B̑̈", "C̑̈", "D̑̈", "Ȇ̈", "F̑̈", "G̑̈", "H̑̈",
                    "Ȋ̈", "J̑̈", "K̑̈", "L̑̈", "M̑̈", "N̑̈", "Ȏ̈", "P̑̈", "Q̑̈", "Ȓ̈", "S̑̈", "T̑̈", "Ȗ̈", "V̑̈", "W̑̈", "X̑̈", "Y̑̈", "Z̑̈",
                    "̑̈"};
        } else if (nameFont.equals(Constant.FONT_SCRIPT)) {
            return new CharSequence[]{"𝒶", "𝒷", "𝒸", "𝒹", "ℯ", "𝒻", "𝓰", "𝒽", "𝒾", "𝒿", "𝓀", "𝓁", "𝓂", "𝓃", "ℴ", "𝓅", "𝓆", "𝓇", "𝓈",
                    "𝓉", "𝓊", "𝓋", "𝓌", "𝓍", "𝓎", "𝓏", "𝒜", "ℬ", "𝒞", "𝒟", "ℰ", "ℱ", "𝒢", "ℋ", "ℐ", "𝒥", "𝒦", "ℒ", "ℳ", "𝒩", "𝒪", "𝒫",
                    "𝒬", "ℛ", "𝒮", "𝒯", "𝒰", "𝒱", "𝒲", "𝒳", "𝒴", "𝒵"};
        } else if (nameFont.equals(Constant.FONT_SCRIPT_BOLD)) {
            return new CharSequence[]{"𝓪", "𝓫", "𝓬", "𝓭", "𝓮", "𝓯", "𝓰", "𝓱", "𝓲", "𝓳", "𝓴", "𝓵", "𝓶", "𝓷", "𝓸", "𝓹", "𝓺", "𝓻",
                    "𝓼", "𝓽", "𝓾", "𝓿", "𝔀", "𝔁", "𝔂", "𝔃", "𝓐", "𝓑", "𝓒", "𝓓", "𝓔", "𝓕", "𝓖", "𝓗", "𝓘", "𝓙", "𝓚", "𝓛", "𝓜",
                    "𝓝", "𝓞", "𝓟", "𝓠", "𝓡", "𝓢", "𝓣", "𝓤", "𝓥", "𝓦", "𝓧", "𝓨", "𝓩"};
        } else if (nameFont.equals(Constant.FONT_SERIF_BOLD)) {
            return new CharSequence[]{"𝐚", "𝐛", "𝐜", "𝐝", "𝐞", "𝐟", "𝐠", "𝐡", "𝐢", "𝐣", "𝐤", "𝐥", "𝐦", "𝐧", "𝐨", "𝐩", "𝐪", "𝐫",
                    "𝐬", "𝐭", "𝐮", "𝐯", "𝐰", "𝐱", "𝐲", "𝐳", "𝐀", "𝐁", "𝐂", "𝐃", "𝐄", "𝐅", "𝐆", "𝐇", "𝐈", "𝐉", "𝐊", "𝐋", "𝐌",
                    "𝐍", "𝐎", "𝐏", "𝐐", "𝐑", "𝐒", "𝐓", "𝐔", "𝐕", "𝐖", "𝐗", "𝐘", "𝐙"};
        } else if (nameFont.equals(Constant.FONT_SERIF_BOLD_ITALIC)) {
            return new CharSequence[]{"𝒂", "𝒃", "𝒄", "𝒅", "𝒆", "𝒇", "𝒈", "𝒉", "𝒊", "𝒋", "𝒌", "𝒍", "𝒎", "𝒏", "𝒐", "𝒑", "𝒒", "𝒓",
                    "𝒔", "𝒕", "𝒖", "𝒗", "𝒘", "𝒙", "𝒚", "𝒛", "𝑨", "𝑩", "𝑪", "𝑫", "𝑬", "𝑭", "𝑮", "𝑯", "𝑰", "𝑱", "𝑲", "𝑳", "𝑴",
                    "𝑵", "𝑶", "𝑷", "𝑸", "𝑹", "𝑺", "𝑻", "𝑼", "𝑽", "𝑾", "𝑿", "𝒀", "𝒁"};
        } else if (nameFont.equals(Constant.FONT_SERIF_ITALIC)) {
            return new CharSequence[]{"𝑎", "𝑏", "𝑐", "𝑑", "𝑒", "𝑓", "𝑔", "ℎ", "𝑖", "𝑗", "𝑘", "𝑙", "𝑚", "𝑛", "𝑜", "𝑝", "𝑞", "𝑟", "𝑠",
                    "𝑡", "𝑢", "𝑣", "𝑤", "𝑥", "𝑦", "𝑧", "𝐴", "𝐵", "𝐶", "𝐷", "𝐸", "𝐹", "𝐺", "𝐻", "𝐼", "𝐽", "𝐾", "𝐿", "𝑀", "𝑁",
                    "𝑂", "𝑃", "𝑄", "𝑅", "𝑆", "𝑇", "𝑈", "𝑉", "𝑊", "𝑋", "𝑌", "𝑍"};
        } else if (nameFont.equals(Constant.FONT_SKY_LINE)) {
            return new CharSequence[]{"a̺͆", "b̺͆", "c̺͆", "d̺͆", "e̺͆", "f̺͆", "g̺͆", "h̺͆", "i̺͆", "j̺͆", "k̺͆", "l̺͆", "m̺͆", "n̺͆", "o̺͆", "p̺͆",
                    "q̺͆", "r̺͆", "s̺͆", "t̺͆", "u̺͆", "v̺͆", "w̺͆", "x̺͆", "y̺͆", "z̺͆", "A̺͆", "B̺͆", "C̺͆", "D̺͆", "E̺͆", "F̺͆", "G̺͆", "H̺͆",
                    "I̺͆", "J̺͆", "K̺͆", "L̺͆", "M̺͆", "N̺͆", "O̺͆", "P̺͆", "Q̺͆", "R̺͆", "S̺͆", "T̺͆", "U̺͆", "V̺͆", "W̺͆", "X̺͆", "Y̺͆", "Z̺͆",
                    "̺͆"};
        } else if (nameFont.equals(Constant.FONT_SLASH)) {
            return new CharSequence[]{"a̸", "b̸", "c̸", "d̸", "e̸", "f̸", "g̸", "h̸", "i̸", "j̸", "k̸", "l̸", "m̸", "n̸", "o̸", "p̸", "q̸", "r̸",
                    "s̸", "t̸", "u̸", "v̸", "w̸", "x̸", "y̸", "z̸", "A̸", "B̸", "C̸", "D̸", "E̸", "F̸", "G̸", "H̸", "I̸", "J̸", "K̸", "L̸", "M̸",
                    "N̸", "O̸", "P̸", "Q̸", "R̸", "S̸", "T̸", "U̸", "V̸", "W̸", "X̸", "Y̸", "Z̸", "̸"};
        } else if (nameFont.equals(Constant.FONT_SQUARE_DASHED)) {
            return new CharSequence[]{"🇦 ", "🇧 ", "🇨 ", "🇩 ", "🇪 ", "🇫 ", "🇬 ", "🇭 ", "🇮 ", "🇯 ", "🇰 ", "🇱 ", "🇲 ", "🇳 ", "🇴 ", "🇵 ",
                    "🇶 ", "🇷 ", "🇸 ", "🇹 ", "🇺 ", "🇻 ", "🇼 ", "🇽 ", "🇾 ", "🇿 ", "🇦 ", "🇧 ", "🇨 ", "🇩 ", "🇪 ", "🇫 ", "🇬 ", "🇭 ",
                    "🇮 ", "🇯 ", "🇰 ", "🇱 ", "🇲 ", "🇳 ", "🇴 ", "🇵 ", "🇶 ", "🇷 ", "🇸 ", "🇹 ", "🇺 ", "🇻 ", "🇼 ", "🇽 ", "🇾 ", "🇿 "};
        } else if (nameFont.equals(Constant.FONT_SQUARES_FILLED)) {
            return new CharSequence[]{"🅰︎", "🅱︎", "🅲︎", "🅳︎", "🅴︎", "🅵︎", "🅶︎", "🅷︎", "🅸︎", "🅹︎", "🅺︎", "🅻︎", "🅼︎", "🅽︎", "🅾︎", "🅿︎",
                    "🆀︎", "🆁︎", "🆂︎", "🆃︎", "🆄︎", "🆅︎", "🆆︎", "🆇︎", "🆈︎", "🆉︎", "🅰︎", "🅱︎", "🅲︎", "🅳︎", "🅴︎", "🅵︎", "🅶︎", "🅷︎",
                    "🅸︎", "🅹︎", "🅺︎", "🅻︎", "🅼︎", "🅽︎", "🅾︎", "🅿︎", "🆀︎", "🆁︎", "🆂︎", "🆃︎", "🆄︎", "🆅︎", "🆆︎", "🆇︎", "🆈︎", "🆉︎"};
        } else if (nameFont.equals(Constant.FONT_SQUARES_OUTLINE)) {
            return new CharSequence[]{"🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼", "🄽", "🄾", "🄿", "🅀", "🅁",
                    "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉", "🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼",
                    "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉"};
        } else if (nameFont.equals(Constant.FONT_STINKY)) {
            return new CharSequence[]{"a̾", "b̾", "c̾", "d̾", "e̾", "f̾", "g̾", "h̾", "i̾", "j̾", "k̾", "l̾", "m̾", "n̾", "o̾", "p̾", "q̾", "r̾",
                    "s̾", "t̾", "u̾", "v̾", "w̾", "x̾", "y̾", "z̾", "A̾", "B̾", "C̾", "D̾", "E̾", "F̾", "G̾", "H̾", "I̾", "J̾", "K̾", "L̾", "M̾",
                    "N̾", "O̾", "P̾", "Q̾", "R̾", "S̾", "T̾", "U̾", "V̾", "W̾", "X̾", "Y̾", "Z̾", "̾"};
        } else if (nameFont.equals(Constant.FONT_STOP)) {
            return new CharSequence[]{"a⃠", "b⃠", "c⃠", "d⃠", "e⃠", "f⃠", "g⃠", "h⃠", "i⃠", "j⃠", "k⃠", "l⃠", "m⃠", "n⃠", "o⃠", "p⃠", "q⃠", "r⃠",
                    "s⃠", "t⃠", "u⃠", "v⃠", "w⃠", "x⃠", "y⃠", "z⃠", "A⃠", "B⃠", "C⃠", "D⃠", "E⃠", "F⃠", "G⃠", "H⃠", "I⃠", "J⃠", "K⃠", "L⃠", "M⃠",
                    "N⃠", "O⃠", "P⃠", "Q⃠", "R⃠", "S⃠", "T⃠", "U⃠", "V⃠", "W⃠", "X⃠", "Y⃠", "Z⃠", "⃠"};
        } else if (nameFont.equals(Constant.FONT_STICKE_THROUGH)) {
            return new CharSequence[]{"a̶", "b̶", "c̶", "d̶", "e̶", "f̶", "g̶", "h̶", "i̶", "j̶", "k̶", "l̶", "m̶", "n̶", "o̶", "p̶", "q̶", "r̶",
                    "s̶", "t̶", "u̶", "v̶", "w̶", "x̶", "y̶", "z̶", "A̶", "B̶", "C̶", "D̶", "E̶", "F̶", "G̶", "H̶", "I̶", "J̶", "K̶", "L̶", "M̶",
                    "N̶", "O̶", "P̶", "Q̶", "R̶", "S̶", "T̶", "U̶", "V̶", "W̶", "X̶", "Y̶", "Z̶", "̶"};
        } else if (nameFont.equals(Constant.FONT_TINY)) {
            return new CharSequence[]{"ᵃ", "ᵇ", "ᶜ", "ᵈ", "ᵉ", "ᶠ", "ᵍ", "ʰ", "ⁱ", "ʲ", "ᵏ", "ˡ", "ᵐ", "ⁿ", "ᵒ", "ᵖ", "ᵠ", "ʳ", "ˢ", "ᵗ", "ᵘ", "ᵛ",
                    "ʷ", "ˣ", "ʸ", "ᶻ", "ᵃ", "ᵇ", "ᶜ", "ᵈ", "ᵉ", "ᶠ", "ᵍ", "ʰ", "ⁱ", "ʲ", "ᵏ", "ˡ", "ᵐ", "ⁿ", "ᵒ", "ᵖ", "ᵠ", "ʳ", "ˢ", "ᵗ", "ᵘ", "ᵛ",
                    "ʷ", "ˣ", "ʸ", "ᶻ"};
        }/* else if (nameFont.equals(Constant.FONT_TYPE_WRITE)) {
            return new CharSequence[]{"𝚊", "𝚋", "𝚌", "𝚍", "𝚎", "𝚏", "𝚐", "𝚑", "𝚒", "𝚓", "𝚔", "𝚕", "𝚖", "𝚗", "𝚘", "𝚙", "𝚚", "𝚛",
                    "𝚜", "𝚝", "𝚞", "𝚟", "𝚠", "𝚡", "𝚢", "𝚣", "𝙰", "𝙱", "𝙲", "𝙳", "𝙴", "𝙵", "𝙶", "𝙷", "𝙸", "𝙹", "𝙺", "𝙻", "𝙼",
                    "𝙽", "𝙾", "𝙿", "𝚀", "𝚁", "𝚂", "𝚃", "𝚄", "𝚅", "𝚆", "𝚇", "𝚈", "𝚉"};
        } */else if (nameFont.equals(Constant.FONT_UNDERLINE)) {
            return new CharSequence[]{"a͟", "b͟", "c͟", "d͟", "e͟", "f͟", "g͟", "h͟", "i͟", "j͟", "k͟", "l͟", "m͟", "n͟", "o͟", "p͟", "q͟", "r͟",
                    "s͟", "t͟", "u͟", "v͟", "w͟", "x͟", "y͟", "z͟", "A͟", "B͟", "C͟", "D͟", "E͟", "F͟", "G͟", "H͟", "I͟", "J͟", "K͟", "L͟", "M͟",
                    "N͟", "O͟", "P͟", "Q͟", "R͟", "S͟", "T͟", "U͟", "V͟", "W͟", "X͟", "Y͟", "Z͟", "͟"};
        } else if (nameFont.equals(Constant.FONT_COMIC)) {
            return new CharSequence[]{"ᗩ", "ᗷ", "ᑕ", "ᗪ", "ᗴ", "ᖴ", "ᘜ", "ᕼ", "I", "ᒍ", "K", "ᒪ", "ᗰ", "ᑎ", "O", "ᑭ", "ᑫ", "ᖇ", "Տ", "T", "ᑌ", "ᐯ",
                    "ᗯ", "᙭", "Y", "ᘔ", "ᗩ", "ᗷ", "ᑕ", "ᗪ", "ᗴ", "ᖴ", "ᘜ", "ᕼ", "I", "ᒍ", "K", "ᒪ", "ᗰ", "ᑎ", "O", "ᑭ", "ᑫ", "ᖇ", "Տ", "T", "ᑌ", "ᐯ",
                    "ᗯ", "᙭", "Y", "ᘔ"};
        } else if (nameFont.equals(Constant.FONT_EMOJI1)) {
            return new CharSequence[]{"❤︎", "❣︎", "☾︎", "☽︎", "♫︎", "𓂸", "𓂺", "シ︎", "㋛︎", "ت︎", "♡︎", "♥︎", "❥︎", "ఌ︎", "ꨄ︎", "❦︎", "☀︎︎", "☹︎",
                    "☻︎", "☺︎︎", "☠︎︎", "༒︎", "✞︎", "✔︎", "☏︎", "𓆉︎", "❤︎", "❣︎", "☾︎", "☽︎", "♫︎", "𓂸", "𓂺", "シ︎", "㋛︎", "ت︎", "♡︎", "♥︎", "❥︎",
                    "ఌ︎", "ꨄ︎", "❦︎", "☀︎︎", "☹︎", "☻︎", "☺︎︎", "☠︎︎", "༒︎", "✞︎", "✔︎", "☏︎", "𓆉︎"};
        } else if (nameFont.equals(Constant.FONT_EMOJI2)) {
            return new CharSequence[]{"★", "✰", "✯", "☆", "✩", "✵", "༆", "༄", "߷", "𖦹", "☢︎︎", "☼︎", "᯽", "✫", "۞", "𖣔", "⍟", "𖣘", "☦︎", "Ꙭ", "❀",
                    "❄︎", "❁", "᯾", "✪", "⁂", "★", "✰", "✯", "☆", "✩", "✵", "༆", "༄", "߷", "𖦹", "☢︎︎", "☼︎", "᯽", "✫", "۞", "𖣔", "⍟", "𖣘", "☦︎",
                    "Ꙭ", "❀", "❄︎", "❁", "᯾", "✪", "⁂"};
        } else if (nameFont.equals(Constant.FONT_EMOJI3)) {
            return new CharSequence[]{"𓅓", "𓆙", "␈", "𐂃", "𐂂", "𓀬", "𓆈", "𓃗", "𓃱", "𓀡", "𓅷", "𓆏", "𓃰", "𓄁", "𓃠", "𓅿", "𓃟", "𓂻", "♔︎",
                    "♕︎", "𓀿", "𓀐", "𓂉", "⚣︎", "⚢︎", "⚣︎", "𓅓", "𓆙", "␈", "𐂃", "𐂂", "𓀬", "𓆈", "𓃗", "𓃱", "𓀡", "𓅷", "𓆏", "𓃰", "𓄁", "𓃠",
                    "𓅿", "𓃟", "𓂻", "♔︎", "♕︎", "𓀿", "𓀐", "𓂉", "⚣︎", "⚢︎", "⚣︎"};
        } else if (nameFont.equals(Constant.FONT_EMOJI4)) {
            return new CharSequence[]{"☯︎", "♲︎︎︎", "𒊹︎︎︎", "ᴥ︎︎︎", "♪", "➪", "⌨︎", "♧︎︎︎", "☘︎", "☁︎", "✌︎", "☜︎︎︎", "☝︎", "☞︎︎︎", "☟︎︎︎", "✍︎",
                    "☕︎", "𓇽", "✈︎", "☮︎", "☃︎", "꧁", "꧂", "☂︎", "☔︎", "⚠︎", "☯︎", "♲︎︎︎", "𒊹︎︎︎", "ᴥ︎︎︎", "♪", "➪", "⌨︎", "♧︎︎︎", "☘︎", "☁︎", "✌︎",
                    "☜︎︎︎", "☝︎", "☞︎︎︎", "☟︎︎︎", "✍︎", "☕︎", "𓇽", "✈︎", "☮︎", "☃︎", "꧁", "꧂", "☂︎", "☔︎", "⚠︎"};
        } else if (nameFont.equals(Constant.FONT_SANS)) {
            return new CharSequence[]{"𝖺", "𝖻", "𝖼", "𝖽", "𝖾", "𝖿", "𝗀", "𝗁", "𝗂", "𝗃", "𝗄", "𝗅", "𝗆", "𝗇", "𝗈", "𝗉", "𝗊", "𝗋",
                    "𝗌", "𝗍", "𝗎", "𝗏", "𝗐", "𝗑", "𝗒", "𝗓", "𝖠", "𝖡", "𝖢", "𝖣", "𝖤", "𝖥", "𝖦", "𝖧", "𝖨", "𝖩", "𝖪", "𝖫", "𝖬",
                    "𝖭", "𝖮", "𝖯", "𝖰", "𝖱", "𝖲", "𝖳", "𝖴", "𝖵", "𝖶", "𝖷", "𝖸", "𝖹"};
        } else if (nameFont.equals(Constant.FONT_SANS_BOLD)) {
            return new CharSequence[]{"𝗮", "𝗯", "𝗰", "𝗱", "𝗲", "𝗳", "𝗴", "𝗵", "𝗶", "𝗷", "𝗸", "𝗹", "𝗺", "𝗻", "𝗼", "𝗽", "𝗾", "𝗿",
                    "𝘀", "𝘁", "𝘂", "𝘃", "𝘄", "𝘅", "𝘆", "𝘇", "𝗔", "𝗕", "𝗖", "𝗗", "𝗘", "𝗙", "𝗚", "𝗛", "𝗜", "𝗝", "𝗞", "𝗟", "𝗠",
                    "𝗡", "𝗢", "𝗣", "𝗤", "𝗥", "𝗦", "𝗧", "𝗨", "𝗩", "𝗪", "𝗫", "𝗬", "𝗭"};
        } else if (nameFont.equals(Constant.FONT_SANS_BOLD_ITALIC)) {
            return new CharSequence[]{"𝙖", "𝙗", "𝙘", "𝙙", "𝙚", "𝙛", "𝙜", "𝙝", "𝙞", "𝙟", "𝙠", "𝙡", "𝙢", "𝙣", "𝙤", "𝙥", "𝙦", "𝙧",
                    "𝙨", "𝙩", "𝙪", "𝙫", "𝙬", "𝙭", "𝙮", "𝙯", "𝘼", "𝘽", "𝘾", "𝘿", "𝙀", "𝙁", "𝙂", "𝙃", "𝙄", "𝙅", "𝙆", "𝙇", "𝙈",
                    "𝙉", "𝙊", "𝙋", "𝙌", "𝙍", "𝙎", "𝙏", "𝙐", "𝙑", "𝙒", "𝙓", "𝙔", "𝙕"};
        } else if (nameFont.equals(Constant.FONT_SANS_ITALIC)) {
            return new CharSequence[]{"𝘢", "𝘣", "𝘤", "𝘥", "𝘦", "𝘧", "𝘨", "𝘩", "𝘪", "𝘫", "𝘬", "𝘭", "𝘮", "𝘯", "𝘰", "𝘱", "𝘲", "𝘳",
                    "𝘴", "𝘵", "𝘶", "𝘷", "𝘸", "𝘹", "𝘺", "𝘻", "𝘈", "𝘉", "𝘊", "𝘋", "𝘌", "𝘍", "𝘎", "𝘏", "𝘐", "𝘑", "𝘒", "𝘓", "𝘔",
                    "𝘕", "𝘖", "𝘗", "𝘘", "𝘙", "𝘚", "𝘛", "𝘜", "𝘝", "𝘞", "𝘟", "𝘠", "𝘡"};
        } else if (nameFont.equals(Constant.FONT_RUNS)) {
            return new CharSequence[]{"ል", "ጌ", "ር", "ዕ", "ቿ", "ቻ", "ኗ", "ዘ", "ጎ", "ጋ", "ጕ", "ረ", "ጠ", "ክ", "ዐ", "የ", "ዒ", "ዪ", "ነ", "ፕ", "ሁ", "ሀ",
                    "ሠ", "ሸ", "ሃ", "ጊ", "ል", "ጌ", "ር", "ዕ", "ቿ", "ቻ", "ኗ", "ዘ", "ጎ", "ጋ", "ጕ", "ረ", "ጠ", "ክ", "ዐ", "የ", "ዒ", "ዪ", "ነ", "ፕ", "ሁ", "ሀ",
                    "ሠ", "ሸ", "ሃ", "ጊ"};
        } else if (nameFont.equals(Constant.FONT_UPSIDE_DOWN)) {
            return new CharSequence[]{"ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ᴉ", "ɾ", "ʞ", "l", "ɯ", "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ",
                    "ʍ", "x", "ʎ", "z", "ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ᴉ", "ɾ", "ʞ", "l", "ɯ", "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ",
                    "ʍ", "x", "ʎ", "z"};
        }

        //hoangld update font
        else if (nameFont.equals(Constant.FONT_ANCIENT)) {
            return new CharSequence[]{"α", "β", "ϲ", "δ", "ε", "ẜ", "ϑ", "հ", "ι", "յ", "Κ", "ℓ", "ʍ", "ƞ", "ɸ", "⅊", "θ", "ʀ", "ៜ", "τ", "υ", "⋎",
                    "w", "ϰ", "ψ", "z", "Δ", "Β", "С", "D", "Ξ", "ᚫ", "Ǥ", "Η", "I", "Ј", "Ƙ", "Ꮣ", "Μ", "Ŋ", "Ѳ", "♇", "Θ", "Ɍ", "⟆", "Γ", "Ʊ", "Ɣ",
                    "W", "χ", "Ψ", "Z"};
        } else if (nameFont.equals(Constant.FONT_NIGMATIC)) {
            return new CharSequence[]{"α", "в", "c", "∂", "ɛ", "ғ", "ɢ", "н", "ι", "ʝ", "κ", "ℓ", "м", "и", "σ", "ρ", "զ", "я", "ƨ", "т", "ʋ", "ʏ",
                    "ω", "ϰ", "ʏ", "ʓ", "𝗔", "β", "Ɔ", "Ɖ", "Є", "Ғ", "Ǥ", "Ħ", "Ɩ", "Ĵ", "Ƙ", "˩", "Μ", "И", "Ѳ", "Ƥ", "Ǫ", "Я", "Ƨ", "Ƭ", "Ʋ", "Ѵ",
                    "Ɯ", "Ƶ", "𝗬", "𝗭"};
        } else if (nameFont.equals(Constant.FONT_EMOJI5)) {
            return new CharSequence[]{"🅰", "🅱", "🌜", "👌", "📧", "🎏", "🌀", "🎿", "📍", "🎷", "🎋", "💪", "Ⓜ", "🎵", "⭕", "🅿", "🍭", "®", "💰",
                    "🌴", "👅", "🍸", "⚓", "❌", "🍸", "💤", "🅰", "🅱", "🌜", "👌", "📧", "🎏", "🌀", "🎿", "📍", "🎷", "🎋", "💪", "Ⓜ", "🎵", "⭕",
                    "🅿", "🍭", "®", "💰", "🌴", "👅", "🍸", "⚓", "❌", "🍸", "💤"};
        } else if (nameFont.equals(Constant.FONT_HIGH_LIGHTS)) {
            return new CharSequence[]{"á", "b", "ć", "ď", "è", "f", "ġ", "ĥ", "Ì", "j", "k", "l", "m", "ń", "ő", "p", "q", "ŕ", "ś", "ť", "ú", "v",
                    "ŵ", "x", "ý", "ź", "Á", "B", "Č", "Ď", "É", "F", "Ġ", "Ĥ", "I", "J", "K", "Ĺ", "M", "Ń", "Ó", "P", "Q", "Ŕ", "Ś", "Ť", "Ú", "V",
                    "Ŵ", "X", "Ŷ", "Ź"};
        } else if (nameFont.equals(Constant.FONT_CURVY_TAIL)) {
            return new CharSequence[]{"ą", "ɓ", "ç", "d", "ę", "ƒ", "ɠ", "ђ", "į", "ʝ", "ķ", "ɭ", "ɱ", "ŋ", "ǫ", "ƥ", "ʠ", "ŗ", "ş", "ţ", "ų", "v",
                    "w", "ҳ", "ƴ", "ʐ", "ą", "ɓ", "ç", "d", "ę", "ƒ", "ɠ", "ђ", "į", "ʝ", "ķ", "ɭ", "ɱ", "ŋ", "ǫ", "ƥ", "ʠ", "ŗ", "ş", "ţ", "ų", "v",
                    "w", "ҳ", "ƴ", "ʐ"};
        } else if (nameFont.equals(Constant.FONT_MYTHOLOGY)) {
            return new CharSequence[]{"Ꭿ", "Ᏸ", "Ꮸ", "Ꭰ", "Ꭼ", "Ꮀ", "Ꮆ", "Ꮋ", "Ꭸ", "Ꮰ", "Ꮶ", "Ꮭ", "Ꮇ", "Ꮑ", "Ꮎ", "Ꮲ", "Ꮕ", "Ꮢ", "Ꮥ", "Ꮏ", "Ꮼ", "Ꮙ",
                    "Ꮿ", "Ꮂ", "Ꮍ", "Ꮓ", "Ꭿ", "Ᏸ", "Ꮸ", "Ꭰ", "Ꭼ", "Ꮀ", "Ꮆ", "Ꮋ", "Ꭸ", "Ꮰ", "Ꮶ", "Ꮭ", "Ꮇ", "Ꮑ", "Ꮎ", "Ꮲ", "Ꮕ", "Ꮢ", "Ꮥ", "Ꮏ", "Ꮼ", "Ꮙ",
                    "Ꮿ", "Ꮂ", "Ꮍ", "Ꮓ"};
        } else if (nameFont.equals(Constant.FONT_SHALASY)) {
            return new CharSequence[]{"a༙", "b༙", "c༙", "d༙", "e༙", "f༙", "g༙", "h༙", "i༙", "j༙", "k༙", "l༙", "m༙", "n༙", "o༙", "p༙",
                    "q༙", "r༙", "s༙", "t༙", "u༙", "v༙", "w༙", "x༙", "y༙", "z༙", "A༙", "B༙", "C༙", "D༙", "E༙", "F༙", "G༙", "H༙",
                    "I༙", "J༙", "K༙", "L༙", "M༙", "N༙", "O༙", "P༙", "Q༙", "R༙", "S༙", "T༙", "U༙", "V༙", "W༙", "X༙", "Y༙", "Z༙",
                    "༙"};


        } else if (nameFont.equals(Constant.FONT_RAILS)) {
            return new CharSequence[]{"a̲̅", "b̲̅", "c̲̅", "d̲̅", "e̲̅", "f̲̅", "g̲̅", "h̲̅", "i̲̅", "j̲̅", "k̲̅", "l̲̅", "m̲̅", "n̲̅", "o̲̅", "p̲̅",
                    "q̲̅", "r̲̅", "s̲̅", "t̲̅", "u̲̅", "v̲̅", "w̲̅", "x̲̅", "y̲̅", "z̲̅", "A̲̅", "B̲̅", "C̲̅", "D̲̅", "E̲̅", "F̲̅", "G̲̅", "H̲̅",
                    "I̲̅", "J̲̅", "K̲̅", "L̲̅", "M̲̅", "N̲̅", "O̲̅", "P̲̅", "Q̲̅", "R̲̅", "S̲̅", "T̲̅", "U̲̅", "V̲̅", "W̲̅", "X̲̅", "Y̲̅", "Z̲̅",
                    "̲̅"};
        } else if (nameFont.equals(Constant.FONT_COMIC_FUN)) {
            return new CharSequence[]{"ᗩ", "ᗷ", "ᑕ", "ᗪ", "Ɛ", "F", "G", "ℎ", "Ɩ", "ᒍ", "Ƙ", "ᒪ", "ᗰ", "ᑎ", "O", "ᑭ", "ᑫ", "ᖇ", "ᔕ", "Ƭ", "ᑌ", "ᐯ",
                    "ᗯ", "᙭", "Ƴ", "ᘔ", "ᗩ", "ᗷ", "ᑕ", "ᗪ", "Ɛ", "F", "G", "H", "Ɩ", "ᒍ", "Ƙ", "ᒪ", "ᗰ", "ᑎ", "O", "ᑭ", "ᑫ", "ᖇ", "ᔕ", "Ƭ", "ᑌ", "ᐯ",
                    "ᗯ", "᙭", "Ƴ", "ᘔ"};
        } else if (nameFont.equals(Constant.FONT_DOTIFY)) {
            return new CharSequence[]{"ä̤", "b̤̈", "c̤̈", "d̤̈", "ë̤", "f̤̈", "g̤̈", "ḧ̤", "ï̤", "j̤̈", "k̤̈", "l̤̈", "m̤̈", "n̤̈", "ö̤", "p̤̈",
                    "q̤̈", "r̤̈", "s̤̈", "ẗ̤", "ṳ̈", "v̤̈", "ẅ̤", "ẍ̤", "ÿ̤", "z̤̈", "Ä̤", "B̤̈", "C̤̈", "D̤̈", "Ë̤", "F̤̈", "G̤̈", "Ḧ̤",
                    "Ï̤", "J̤̈", "K̤̈", "L̤̈", "M̤̈", "N̤̈", "Ö̤", "P̤̈", "Q̤̈", "R̤̈", "S̤̈", "T̤̈", "Ṳ̈", "V̤̈", "Ẅ̤", "Ẍ̤", "Ÿ̤", "Z̤̈",
                    "̤̈"};
        } else if (nameFont.equals(Constant.FONT_WIDE_SPACE)) {
            return new CharSequence[]{"ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ",
                    "ｗ", "ｘ", "ｙ", "ｚ", "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ",
                    "Ｗ", "Ｘ", "Ｙ", "Ｚ"};
        } else if (nameFont.equals(Constant.FONT_RUSCRIPT)) {
            return new CharSequence[]{"a", "в", "c", "d", "ё", "f", "g", "н", "ї", "j", "к", "l", "м", "п", "о", "p", "q", "я", "$", "т", "ц", "v",
                    "щ", "ж", "у", "z", "Д", "B", "C", "D", "Є", "F", "G", "H", "Ї", "J", "К", "L", "M", "Й", "О", "P", "Ｑ", "Я", "$", "T", "Ц", "V",
                    "Ш", "Ж", "У", "Z"};
        } else if (nameFont.equals(Constant.FONT_RSUMNEZ)) {
            return new CharSequence[]{"@", "♭", "ḉ", "∂", "ε", "ḟ", "ℊ", "н", "ḯ", "ʝ", "ḱ", "ʟ", "ღ", "η", "ø", "℘", "ⓠ", "ʊ", "ṽ", "ẘ", "я", "﹩",
                    "⊥", "✖", "¥", "ℨ", "∀", "฿", "☾", "Ð", "∃", "ℱ", "Ḡ", "Ħ", "ℐ", "J", "Ḱ", "Ḻ", "ℳ", "И", "Ⓞ", "ℙ", "ℚ", "ℝ", "Ꮥ", "✞", "Ü", "Ṽ",
                    "Ш", "Ẍ", "Ẏ", "Ẑ"};
        } else if (nameFont.equals(Constant.FONT_STRIKE_THROUGH)) {
            return new CharSequence[]{"a̶", "̶b", "̶c", "̶d", "̶e", "̶f", "̶g", "̶h", "̶i", "̶j", "̶k", "̶l", "̶m", "̶n", "̶o", "̶p", "̶q", "̶r",
                    "̶s", "̶t", "̶u", "̶v", "̶w", "̶x", "̶y", "̶z", "̶ A", "̶B", "̶C", "̶D", "̶E", "̶F", "̶G", "̶H", "̶I", "̶J", "̶K", "̶M", "̶L",
                    "̶N", "̶O", "̶P", "̶Q", "̶R", "̶S", "̶T", "̶U", "̶V", "̶W", "̶X", "̶Y", "Z̶", "̶"};
        } else if (nameFont.equals(Constant.FONT_BRALMY)) {
            return new CharSequence[]{"ᗩ", "ᕊ", "ᙅ", "ᖙ", "ᙓ", "ℱ", "𐌾", "ᖺ", "ᓮ", "ᒎ", "Ḱ", "ᒪ", "ᙢ", "ᘉ", "ᗝ", "ᕈ", "ᖳ", "ᖇ", "ᔕ", "t", "ᘎ", "Ⅴ",
                    "ᙡ", "ჯ", "Ꭹ", "ᔓ", "ᗩ", "ᗷ", "ᑕ", "ↁ", "ᕮ", "ℱ", "𐌾", "ᕼ", "ᓮ", "ᒎ", "Ḱ", "ᒪ", "ᙢ", "ᘉ", "0", "ᖘ", "Ⴓ", "ᖇ", "ᔕ", "T", "ᕰ", "ᐯ",
                    "ᗯ", "᙭", "Ꭹ", "ᔓ"};
        } else if (nameFont.equals(Constant.FONT_MODER_NOPHICS)) {
            return new CharSequence[]{"", "♭", "☾", "◗", "€", "Ϝ", "❡", "♄", "♗", "♪", "ϰ", "↳", "♔", "♫", "⊙", "ρ", "☭", "☈", "ⓢ", "☂", "☋", "✓",
                    "ω", "☠", "☿", "☡", "", "♭", "☾", "◗", "€", "Ϝ", "❡", "♄", "♗", "♪", "ϰ", "↳", "♔", "♫", "⊙", "ρ", "☭", "☈", "ⓢ", "☂", "☋", "✓",
                    "ω", "☠", "☿", "☡"};
        } else if (nameFont.equals(Constant.FONT_RETRO_TYPE)) {
            return new CharSequence[]{"ค", "ƅ", "ϲ", "Ԁ", "є", "Ŧ", "g", "ђ", "เ", "ן", "к", "l", "៣", "ภ", "๏", "ק", "ợ", "г", "ร", "t", "ย", "ṽ",
                    "ฬ", "ж", "⑂", "z", "ค", "ƅ", "ϲ", "Ԁ", "є", "Ŧ", "g", "ђ", "เ", "ן", "к", "l", "៣", "ภ", "๏", "ק", "ợ", "г", "ร", "t", "ย", "ṽ",
                    "ฬ", "ж", "⑂", "z"};
        } else if (nameFont.equals(Constant.FONT_TINY_WINGS)) {
            return new CharSequence[]{"a", "в", "c", "d", "e", "ғ", "g", "н", "ι", "j", "ĸ", "l", "м", "n", "o", "p", "q", "r", "ѕ", "т", "υ", "v",
                    "w", "х", "y", "z", "a", "в", "c", "d", "e", "ғ", "g", "н", "ι", "j", "ĸ", "l", "м", "n", "o", "p", "q", "r", "ѕ", "т", "υ", "v",
                    "w", "х", "y", "z"};
        } else if (nameFont.equals(Constant.FONT_GOLDY)) {
            return new CharSequence[]{"Ꭿ", "ℬ", "ℂ", "ⅅ", "ℰ", "ℱ", "Ꮆ", "ℋ", "ℐ", "Ꭻ", "Ꮶ", "ℒ", "ℳ", "ℕ", "Ꮎ", "ℙ", "ℚ", "ℛ", "Ѕ", "𝒯", "U", "Ꮙ",
                    "Ꮗ", "X", "Ꮍ", "ℤ", "Ꭿ", "ℬ", "ℂ", "ⅅ", "ℰ", "ℱ", "Ꮆ", "ℋ", "ℐ", "Ꭻ", "Ꮶ", "ℒ", "ℳ", "ℕ", "Ꮎ", "ℙ", "ℚ", "ℛ", "Ѕ", "𝒯", "U", "Ꮙ",
                    "Ꮗ", "X", "Ꮍ", "ℤ"};
        } else if (nameFont.equals(Constant.FONT_HZSOA)) {
            return new CharSequence[]{"4", "8", "(", "d", "3", "f", "9", "h", "!", "j", "k", "1", "m", "n", "0", "p", "q", "r", "5", "7", "u", "v",
                    "w", "x", "y", "2", "4", "8", "(", "d", "3", "f", "9", "h", "!", "j", "k", "1", "m", "n", "0", "p", "q", "r", "5", "7", "u", "v",
                    "w", "x", "y", "2"};
        } else if (nameFont.equals(Constant.FONT_NOT_CHIFY)) {
            return new CharSequence[]{"α", "в", "¢", "∂", "є", "ƒ", "g", "н", "ι", "נ", "к", "ℓ", "м", "η", "σ", "ρ", "q", "я", "ѕ", "т", "υ", "ν",
                    "ω", "χ", "у", "z", "α", "в", "¢", "∂", "є", "ƒ", "g", "н", "ι", "נ", "к", "ℓ", "м", "η", "σ", "ρ", "q", "я", "ѕ", "т", "υ", "ν",
                    "ω", "χ", "у", "z"};
        } else if (nameFont.equals(Constant.FONT_HAMP_SHIRE)) {
            return new CharSequence[]{"Λ", "ß", "Ƈ", "D", "Ɛ", "F", "Ɠ", "Ĥ", "Ī", "Ĵ", "Ҡ", "Ŀ", "M", "И", "Ꮎ", "Ṗ", "Ꮕ", "Ŕ", "S", "Ŧ", "Ʊ", "√",
                    "Ꮿ", "Ӿ", "Y", "Z", "Λ", "ß", "Ƈ", "D", "Ɛ", "F", "Ɠ", "Ĥ", "Ī", "Ĵ", "Ҡ", "Ŀ", "M", "И", "Ꮎ", "Ṗ", "Ꮕ", "Ŕ", "S", "Ŧ", "Ʊ", "√",
                    "Ꮿ", "Ӿ", "Y", "Z"};
        } else if (nameFont.equals(Constant.FONT_SOULURGE)) {
            return new CharSequence[]{"Λ", "Б", "Ͼ", "Ð", "Ξ", "Ŧ", "G", "H", "ł", "J", "К", "Ł", "M", "Л", "Ф", "P", "Ǫ", "Я", "S", "Т", "U", "V",
                    "Ш", "Ж", "Џ", "Z", "Λ", "Б", "Ͼ", "Ð", "Ξ", "Ŧ", "G", "H", "ł", "J", "К", "Ł", "M", "Л", "Ф", "P", "Ǫ", "Я", "S", "Т", "U", "V",
                    "Ш", "Ж", "Џ", "Z"};
        } else if (nameFont.equals(Constant.FONT_BOXIFY)) {
            return new CharSequence[]{"[̲̅a̲̅]", "[̲̅b̲̅]", "[̲̅c̲̅]", "[̲̅d̲̅]", "[̲̅e̲̅]", "[̲̅f̲̅]", "[̲̅g̲̅]", "[̲̅h̲̅]", "[̲̅i̲̅]", "[̲̅j̲̅]",
                    "[̲̅k̲̅]", "[̲̅l̲̅]", "[̲̅m̲̅]", "[̲̅n̲̅]", "[̲̅o̲̅]", "[̲̅p̲̅]", "[̲̅q̲̅]", "[̲̅r̲̅]", "[̲̅s̲̅]", "[̲̅t̲̅]", "[̲̅u̲̅]",
                    "[̲̅v̲̅]", "[̲̅w̲̅]", "[̲̅x̲̅]", "[̲̅y̲̅]", "[̲̅z̲̅]", "[̲̅a̲̅]", "[̲̅b̲̅]", "[̲̅c̲̅]", "[̲̅d̲̅]", "[̲̅e̲̅]", "[̲̅f̲̅]",
                    "[̲̅g̲̅]", "[̲̅h̲̅]", "[̲̅i̲̅]", "[̲̅j̲̅]", "[̲̅k̲̅]", "[̲̅l̲̅]", "[̲̅m̲̅]", "[̲̅n̲̅]", "[̲̅o̲̅]", "[̲̅p̲̅]", "[̲̅q̲̅]",
                    "[̲̅r̲̅]", "[̲̅s̲̅]", "[̲̅t̲̅]", "[̲̅u̲̅]", "[̲̅v̲̅]", "[̲̅w̲̅]", "[̲̅x̲̅]", "[̲̅y̲̅]", "[̲̅z̲̅]", "[̲̲̅̅]"};
        } else if (nameFont.equals(Constant.FONT_RUFF_ROAD)) {
            return new CharSequence[]{"ã̰", "b̰̃", "c̰̃", "d̰̃", "ḛ̃", "f̰̃", "g̰̃", "h̰̃", "ḭ̃", "j̰̃", "k̰̃", "l̰̃", "m̰̃", "ñ̰", "õ̰", "p̰̃",
                    "q̰̃", "r̰̃", "s̰̃", "t̰̃", "ṵ̃", "ṽ̰", "w̰̃", "x̰̃", "ỹ̰", "z̰̃", "Ã̰", "B̰̃", "C̰̃", "D̰̃", "Ḛ̃", "F̰̃", "G̰̃", "H̰̃",
                    "Ḭ̃", "J̰̃", "K̰̃", "L̰̃", "M̰̃", "Ñ̰", "Õ̰", "P̰̃", "Q̰̃", "R̰̃", "S̰̃", "T̰̃", "Ṵ̃", "Ṽ̰", "W̰̃", "X̰̃", "Ỹ̰", "Z̰̃",
                    "̰̃"};
        } else if (nameFont.equals(Constant.FONT_BRACKETS)) {
            return new CharSequence[]{"⒜", "⒝", "⒞", "⒟", "⒠", "⒡", "⒢", "⒣", "⒤", "⒥", "⒦", "⒧", "⒨", "⒩", "⒪", "⒫", "⒬", "⒭", "⒮", "⒯", "⒰", "⒱",
                    "⒲", "⒳", "⒴", "⒵", "⒜", "⒝", "⒞", "⒟", "⒠", "⒡", "⒢", "⒣", "⒤", "⒥", "⒦", "⒧", "⒨", "⒩", "⒪", "⒫", "⒬", "⒭", "⒮", "⒯", "⒰", "⒱",
                    "⒲", "⒳", "⒴", "⒵"};
        } else if (nameFont.equals(Constant.FONT_SUNSHINE)) {
            return new CharSequence[]{"a͎͒", "b͎͒", "c͎͒", "d͎͒", "e͎͒", "f͎͒", "g͎͒", "h͎͒", "i͎͒", "j͎͒", "k͎͒", "l͎͒", "m͎͒", "n͎͒", "o͎͒", "p͎͒",
                    "q͎͒", "r͎͒", "s͎͒", "t͎͒", "u͎͒", "v͎͒", "w͎͒", "x͎͒", "y͎͒", "z͎͒", "A͎͒", "B͎͒", "C͎͒", "D͎͒", "E͎͒", "F͎͒", "G͎͒", "H͎͒",
                    "I͎͒", "J͎͒", "K͎͒", "L͎͒", "M͎͒", "N͎͒", "O͎͒", "P͎͒", "Q͎͒", "R͎͒", "S͎͒", "T͎͒", "U͎͒", "V͎͒", "W͎͒", "X͎͒", "Y͎͒", "Z͎͒",
                    "͎͒"};
        } else if (nameFont.equals(Constant.FONT_EMPIRE)) {
            return new CharSequence[]{"a͎", "b͎", "c͎", "d͎", "e͎", "f͎", "g͎", "h͎", "i͎", "j͎", "k͎", "l͎", "m͎", "n͎", "o͎", "p͎", "q͎", "r͎",
                    "s͎", "t͎", "u͎", "v͎", "w͎", "x͎", "y͎", "z͎", "A͎", "B͎", "C͎", "D͎", "E͎", "F͎", "G͎", "H͎", "I͎", "J͎", "K͎", "L͎", "M͎",
                    "N͎", "O͎", "P͎", "Q͎", "R͎", "S͎", "T͎", "U͎", "V͎", "W͎", "X͎", "Y͎", "Z͎", "͎"};
        } else if (nameFont.equals(Constant.FONT_DEMONS)) {
            return new CharSequence[]{"a͎ͦ", "b͎ͦ", "c͎ͦ", "d͎ͦ", "e͎ͦ", "f͎ͦ", "g͎ͦ", "h͎ͦ", "i͎ͦ", "j͎ͦ", "k͎ͦ", "l͎ͦ", "m͎ͦ", "n͎ͦ", "o͎ͦ", "p͎ͦ",
                    "q͎ͦ", "r͎ͦ", "s͎ͦ", "t͎ͦ", "u͎ͦ", "v͎ͦ", "w͎ͦ", "x͎ͦ", "y͎ͦ", "z͎ͦ", "A͎ͦ", "B͎ͦ", "C͎ͦ", "D͎ͦ", "E͎ͦ", "F͎ͦ", "G͎ͦ", "H͎ͦ",
                    "I͎ͦ", "J͎ͦ", "K͎ͦ", "L͎ͦ", "Mͦ", "Nͦ", "Oͦ", "Pͦ", "Qͦ", "Rͦ", "Sͦ", "Tͦ", "Uͦ", "Vͦ", "Wͦ", "Xͦ", "Yͦ", "Zͦ", "ͦ"};
        } else if (nameFont.equals(Constant.FONT_UNDER_COVER)) {
            return new CharSequence[]{"a͡", "b͡", "c͡", "d͡", "e͡", "f͡", "g͡", "h͡", "i͡", "j͡", "k͡", "l͡", "m͡", "n͡", "o͡", "p͡", "q͡", "r͡",
                    "s͡", "t͡", "u͡", "v͡", "w͡", "x͡", "y͡", "z͡", "A͡", "B͡", "C͡", "D͡", "E͡", "F͡", "G͡", "H͡", "I͡", "J͡", "K͡", "L͡", "M͡",
                    "N͡", "O͡", "P͡", "Q͡", "R͡", "S͡", "T͡", "U͡", "V͡", "W͡", "X͡", "Y͡", "Z͡", "͡"};
        } else if (nameFont.equals(Constant.FONT_GO_RIGHT)) {
            return new CharSequence[]{"a⃗", "b⃗", "c⃗", "d⃗", "e⃗", "f⃗", "g⃗", "h⃗", "i⃗", "j⃗", "k⃗", "l⃗", "m⃗", "n⃗", "o⃗", "p⃗", "q⃗", "r⃗",
                    "s⃗", "t⃗", "u⃗", "v⃗", "w⃗", "x⃗", "y⃗", "z⃗", "A⃗", "B⃗", "C⃗", "D⃗", "E⃗", "F⃗", "G⃗", "H⃗", "I⃗", "J⃗", "K⃗", "L⃗", "M⃗",
                    "N⃗", "O⃗", "P⃗", "Q⃗", "R⃗", "S⃗", "T⃗", "U⃗", "V⃗", "W⃗", "X⃗", "Y⃗", "Z⃗", "⃗"};
        } else if (nameFont.equals(Constant.FONT_GO_LEFT)) {
            return new CharSequence[]{"a⃖", "b⃖", "c⃖", "d⃖", "e⃖", "f⃖", "g⃖", "h⃖", "i⃖", "j⃖", "k⃖", "l⃖", "m⃖", "n⃖", "o⃖", "p⃖", "q⃖", "r⃖",
                    "s⃖", "t⃖", "u⃖", "v⃖", "w⃖", "x⃖", "y⃖", "z⃖", "A⃖", "B⃖", "C⃖", "D⃖", "E⃖", "F⃖", "G⃖", "H⃖", "I⃖", "J⃖", "K⃖", "L⃖", "M⃖",
                    "N⃖", "O⃖", "P⃖", "Q⃖", "R⃖", "S⃖", "T⃖", "U⃖", "V⃖", "W⃖", "X⃖", "Y⃖", "Z⃖", "⃖"};
        } else if (nameFont.equals(Constant.FONT_POP_STAR)) {
            return new CharSequence[]{"a͙", "b͙", "c͙", "d͙", "e͙", "f͙", "g͙", "h͙", "i͙", "j͙", "k͙", "l͙", "m͙", "n͙", "o͙", "p͙", "q͙", "r͙",
                    "s͙", "t͙", "u͙", "v͙", "w͙", "x͙", "y͙", "z͙", "A͙", "B͙", "C͙", "D͙", "E͙", "F͙", "G͙", "H͙", "I͙", "J͙", "K͙", "L͙", "M͙",
                    "N͙", "O͙", "P͙", "Q͙", "R͙", "S͙", "T͙", "U͙", "V͙", "W͙", "X͙", "Y͙", "Z͙", "͙"};
        } else if (nameFont.equals(Constant.FONT_SHINY)) {
            return new CharSequence[]{"a͛", "b͛", "c͛", "d͛", "e͛", "f͛", "g͛", "h͛", "i͛", "j͛", "k͛", "l͛", "m͛", "n͛", "o͛", "p͛", "q͛", "r͛",
                    "s͛", "t͛", "u͛", "v͛", "w͛", "x͛", "y͛", "z͛", "A͛", "B͛", "C͛", "D͛", "E͛", "F͛", "G͛", "H͛", "I͛", "J͛", "K͛", "L͛", "M͛",
                    "N͛", "O͛", "P͛", "Q͛", "R͛", "S͛", "T͛", "U͛", "V͛", "W͛", "X͛", "Y͛", "Z͛", "͛"};
        } else if (nameFont.equals(Constant.FONT_SEASHORE)) {
            return new CharSequence[]{"a͌", "b͌", "c͌", "d͌", "e͌", "f͌", "g͌", "h͌", "i͌", "j͌", "k͌", "l͌", "m͌", "n͌", "o͌", "p͌", "q͌", "r͌",
                    "s͌", "t͌", "u͌", "v͌", "w͌", "x͌", "y͌", "z͌", "A͌", "B͌", "C͌", "D͌", "E͌", "F͌", "G͌", "H͌", "I͌", "J͌", "K͌", "L͌", "M͌",
                    "N͌", "O͌", "P͌", "Q͌", "R͌", "S͌", "T͌", "U͌", "V͌", "W͌", "X͌", "Y͌", "Z͌", "͌"};
        } else if (nameFont.equals(Constant.FONT_TINY_MATE)) {
            return new CharSequence[]{"ᴬ", "ᴮ", "ᵛ", "ᴰ", "ᴱ", "ᶠ", "ᴳ", "ᴴ", "ᴵ", "ᴶ", "ᴷ", "ᴸ", "ᴹ", "ᴺ", "ᴼ", "ᴾ", "ᵟ", "ᴿ", "ˢ", "ᵀ", "ᵁ", "ᵛ",
                    "ᵂ", "ˣ", "ᵞ", "ᶻ", "ᴬ", "ᴮ", "ᵛ", "ᴰ", "ᴱ", "ᶠ", "ᴳ", "ᴴ", "ᴵ", "ᴶ", "ᴷ", "ᴸ", "ᴹ", "ᴺ", "ᴼ", "ᴾ", "ᵟ", "ᴿ", "ˢ", "ᵀ", "ᵁ", "ᵛ",
                    "ᵂ", "ˣ", "ᵞ", "ᶻ"};
        } else if (nameFont.equals(Constant.FONT_PONY_TAIL)) {
            return new CharSequence[]{"a̾", "b̾", "c̾", "d̾", "e̾", "f̾", "g̾", "h̾", "i̾", "j̾", "k̾", "l̾", "m̾", "n̾", "o̾", "p̾", "q̾", "r̾",
                    "s̾", "t̾", "u̾", "v̾", "w̾", "x̾", "y̾", "z̾", "a̾", "b̾", "c̾", "d̾", "e̾", "f̾", "g̾", "h̾", "i̾", "j̾", "k̾", "l̾", "m̾",
                    "n̾", "o̾", "p̾", "q̾", "r̾", "s̾", "t̾", "u̾", "v̾", "w̾", "x̾", "y̾", "z̾", "̾"};
        } else if (nameFont.equals(Constant.FONT_WHEEL)) {
            return new CharSequence[]{"ḁ", "b̥", "c̥", "d̥", "e̥", "f̥", "g̥", "h̥", "i̥", "j̥", "k̥", "l̥", "m̥", "n̥", "o̥", "p̥", "q̥", "r̥",
                    "s̥", "t̥", "u̥", "v̥", "w̥", "x̥", "y̥", "z̥", "Ḁ", "B̥", "C̥", "D̥", "E̥", "F̥", "G̥", "H̥", "I̥", "J̥", "K̥", "L̥", "M̥",
                    "N̥", "O̥", "P̥", "Q̥", "R̥", "S̥", "T̥", "U̥", "V̥", "W̥", "X̥", "Y̥", "Z̥", "̥"};
        } else if (nameFont.equals(Constant.FONT_POSTER)) {
            return new CharSequence[]{"a̽", "b̽", "c̽", "d̽", "e̽", "f̽", "g̽", "h̽", "i̽", "j̽", "k̽", "l̽", "m̽", "n̽", "o̽", "p̽", "q̽", "r̽",
                    "s̽", "t̽", "u̽", "v̽", "w̽", "x̽", "y̽", "z̽", "A̽", "B̽", "C̽", "D̽", "E̽", "F̽", "G̽", "H̽", "I̽", "J̽", "K̽", "L̽", "M̽",
                    "N̽", "O̽", "P̽", "Q̽", "R̽", "S̽", "T̽", "U̽", "V̽", "W̽", "X̽", "Y̽", "Z̽", "̽"};
        } else if (nameFont.equals(Constant.FONT_UPDERLINE)) {
            return new CharSequence[]{"a꙯", "b꙯", "c꙯", "d꙯", "e꙯", "f꙯", "g꙯", "h꙯", "i꙯", "j꙯", "k꙯", "l꙯", "m꙯", "n꙯", "o꙯", "p꙯", "q꙯", "r꙯",
                    "s꙯", "t꙯", "u꙯", "v꙯", "w꙯", "x꙯", "y꙯", "z꙯", "A꙯", "B꙯", "C꙯", "D꙯", "E꙯", "F꙯", "G꙯", "H꙯", "I꙯", "J꙯", "K꙯", "L꙯", "M꙯",
                    "N꙯", "O꙯", "P꙯", "Q꙯", "R꙯", "S꙯", "T꙯", "U꙯", "V꙯", "W꙯", "X꙯", "Y꙯", "Z꙯", "꙯"};
        } else if (nameFont.equals(Constant.FONT_UPPERLINE)) {
            return new CharSequence[]{"a̽͟", "b̽͟", "c̽͟", "d̽͟", "e̽͟", "f̽͟", "g̽͟", "h̽͟", "i̽͟", "j̽͟", "k̽͟", "l̽͟", "m̽͟", "n̽͟", "o̽͟", "p̽͟",
                    "q̽͟", "r̽͟", "s̽͟", "t̽͟", "u̽͟", "v̽͟", "w̽͟", "x̽͟", "y̽͟", "z̽͟", "A̽͟", "B̽͟", "C̽͟", "D̽͟", "E̽͟", "F̽͟", "G̽͟", "H̽͟",
                    "I̽͟", "J̽͟", "K̽͟", "L̽͟", "M̽͟", "N̽͟", "O̽͟", "P̽͟", "Q̽͟", "R̽͟", "S̽͟", "T̽͟", "U̽͟", "V̽͟", "W̽͟", "X̽͟", "Y̽͟", "Z̽͟",
                    "̽͟"};

        } else if (nameFont.equals(Constant.FONT_HIGHT_LIGHTS2)) {
            return new CharSequence[]{"A̳", "B̳", "C̳", "D̳", "E̳", "F̳", "G̳", "H̳", "I̳", "J̳", "K̳", "L̳", "M̳", "N̳", "O̳", "P̳", "Q̳", "R̳",
                    "S̳", "T̳", "U̳", "V̳", "W̳", "X̳", "Y̳", "Z̳", "A̳", "B̳", "C̳", "D̳", "E̳", "F̳", "G̳", "H̳", "I̳", "J̳", "K̳", "L̳", "M̳",
                    "N̳", "O̳", "P̳", "Q̳", "R̳", "S̳", "T̳", "U̳", "V̳", "W̳", "X̳", "Y̳", "Z̳", "̳"};
        } else if (nameFont.equals(Constant.FONT_HORROR_MUSIC)) {
            return new CharSequence[]{"ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "Ꮶ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "⊺", "ʊ", "ʋ",
                    "ա", "x", "ʏ", "ʐ", "ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "Ꮶ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "⊺", "ʊ", "ʋ",
                    "ա", "x", "ʏ", "ʐ"};
        } else if (nameFont.equals(Constant.FONT_CLOUDY)) {
            return new CharSequence[]{"a͜͡", "b͜͡", "c͜͡", "d͜͡", "e͜͡", "f͜͡", "g͜͡", "h͜͡", "i͜͡", "j͜͡", "k͜͡", "l͜͡", "m͜͡", "n͜͡", "o͜͡", "p͜͡",
                    "q͜͡", "r͜͡", "s͜͡", "t͜͡", "u͜͡", "v͜͡", "w͜͡", "x͜͡", "y͜͡", "z͜͡", "A͜͡", "B͜͡", "C͜͡", "D͜͡", "E͜͡", "F͜͡", "G͜͡", "H͜͡",
                    "I͜͡", "J͜͡", "K͜͡", "L͜͡", "M͜͡", "N͜͡", "O͜͡", "P͜͡", "Q͜͡", "R͜͡", "S͜͡", "T͜͡", "U͜͡", "V͜͡", "W͜͡", "X͜͡", "Y͜͡", "Z͜͡",
                    "͜͡"};
        } else if (nameFont.equals(Constant.FONT_MANIAC)) {
            return new CharSequence[]{"∆", "๒", "ς", "∂", "∑", "ﾓ", "б", "ｻ", "ⅰ", "ᴊ", "к", "ﾚ", "㎡", "и", "◊", "ㄕ", "q", "Я", "𐒡", "ɬ", "ㄩ", "𐀖",
                    "ῳ", "χ", "ㄚ", "z", "∆", "๒", "ς", "∂", "∑", "ﾓ", "б", "ｻ", "ⅰ", "ᴊ", "к", "ﾚ", "㎡", "и", "◊", "ㄕ", "q", "Я", "𐒡", "ɬ", "ㄩ",
                    "𐀖", "ῳ", "χ", "ㄚ", "z"};
        } else if (nameFont.equals(Constant.FONT_METHODOLOGY)) {
            return new CharSequence[]{"α", "в", "c", "d", "є", "f", "g", "h", "í", "j", "k", "l", "m", "n", "σ", "p", "q", "u", "v", "w", "r", "ѕ",
                    "t", "х", "ч", "z", "α", "в", "c", "d", "є", "f", "g", "h", "í", "j", "k", "l", "m", "n", "σ", "p", "q", "u", "v", "w", "r", "ѕ",
                    "t", "х", "ч", "z"};
        } else if (nameFont.equals(Constant.FONT_FANTASY)) {
            return new CharSequence[]{"ѧ", "ɞ", "ċ", "Ԁ", "є", "ғ", "ɢ", "һ", "ı", "j", "ҡ", "ʟ", "ṃ", "ṅ", "ȏ", "ƿ", "զ", "я", "ṡ", "ṭ", "ȗ", "ṿ",
                    "ẇ", "×", "ʏ", "ẓ", "ѧ", "ɞ", "ċ", "Ԁ", "є", "ғ", "ɢ", "һ", "ı", "j", "ҡ", "ʟ", "ṃ", "ṅ", "ȏ", "ƿ", "զ", "я", "ṡ", "ṭ", "ȗ", "ṿ",
                    "ẇ", "×", "ʏ", "ẓ"};
        } else if (nameFont.equals(Constant.FONT_EPICURIOUS)) {
            return new CharSequence[]{"ꍏ", "ꌃ", "ꉓ", "ꀸ", "ꍟ", "ꎇ", "ꁅ", "ꃅ", "ꀤ", "ꀭ", "ꀘ", "꒒", "ᛗ", "ꈤ", "ꂦ", "ᖘ", "ꆰ", "ꋪ", "ꌗ", "꓄", "ꀎ", "ᐯ",
                    "ꅏ", "ꊼ", "ꌩ", "ℤ", "ꍏ", "ꌃ", "ꉓ", "ꀸ", "ꍟ", "ꎇ", "ꁅ", "ꃅ", "ꀤ", "ꀭ", "ꀘ", "꒒", "ᛗ", "ꈤ", "ꂦ", "ᖘ", "ꆰ", "ꋪ", "ꌗ", "꓄", "ꀎ", "ᐯ",
                    "ꅏ", "ꊼ", "ꌩ", "ℤ"};
        } else if (nameFont.equals(Constant.FONT_MAGICAL)) {
            return new CharSequence[]{"Ꭺ", "b", "Ꮯ", "Ꭰ", "Ꭼ", "f", "Ꮆ", "h", "Ꭵ", "j", "Ꮶ", "Ꮮ", "m", "Ꮑ", "Ꮎ", "Ꮲ", "q", "Ꮢ", "s", "Ҭ", "u", "Ꮙ",
                    "Ꮃ", "x", "Ꮍ", "Ꮓ", "Ꭺ", "b", "Ꮯ", "Ꭰ", "Ꭼ", "f", "Ꮆ", "h", "Ꭵ", "j", "Ꮶ", "Ꮮ", "m", "Ꮑ", "Ꮎ", "Ꮲ", "q", "Ꮢ", "s", "Ҭ", "u", "Ꮙ",
                    "Ꮃ", "x", "Ꮍ", "Ꮓ"};
        } else if (nameFont.equals(Constant.FONT_FAIRY_TALES)) {
            return new CharSequence[]{"ɑ", "ҍ", "ϲ", "ժ", "ҽ", "ƒ", "ց", "հ", "í", "յ", "Ƙ", "Ӏ", "ʍ", "ղ", "օ", "Թ", "զ", "ɾ", "Տ", "Ե", "մ", "ѵ",
                    "ա", "×", "վ", "Հ", "ɑ", "ҍ", "ϲ", "ժ", "ҽ", "ƒ", "ց", "հ", "í", "յ", "Ƙ", "Ӏ", "ʍ", "ղ", "օ", "Թ", "զ", "ɾ", "Տ", "Ե", "մ", "ѵ",
                    "ա", "×", "վ", "Հ"};
        } else if (nameFont.equals(Constant.FONT_ALAFABIA)) {
            return new CharSequence[]{"ą", "ც", "ƈ", "ɖ", "ɛ", "ʄ", "ɠ", "ɧ", "ı", "ʝ", "ƙ", "Ɩ", "ɱ", "ŋ", "ơ", "℘", "զ", "ཞ", "ʂ", "ɬ", "ų", "۷",
                    "ῳ", "ҳ", "ყ", "ʑ", "ą", "ც", "ƈ", "ɖ", "ɛ", "ʄ", "ɠ", "ɧ", "ı", "ʝ", "ƙ", "Ɩ", "ɱ", "ŋ", "ơ", "℘", "զ", "ཞ", "ʂ", "ɬ", "ų", "۷",
                    "ῳ", "ҳ", "ყ", "ʑ"};
        } else if (nameFont.equals(Constant.FONT_AVENGER)) {
            return new CharSequence[]{"λ", "B", "₡", "Ð", "E", "₣", "G", "Ҥ", "ł", "J", "ƙ", "Ł", "M", "₦", "Ø", "P", "Q", "Ʀ", "$", "₸", "U", "V",
                    "₩", "X", "¥", "Z", "λ", "B", "₡", "Ð", "E", "₣", "G", "Ҥ", "ł", "J", "ƙ", "Ł", "M", "₦", "Ø", "P", "Q", "Ʀ", "$", "₸", "U", "V",
                    "₩", "X", "¥", "Z"};
        } else if (nameFont.equals(Constant.FONT_WICHOLOGY)) {
            return new CharSequence[]{"ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "Ꮶ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "t", "ʊ", "ʋ",
                    "ա", "x", "ʏ", "ʐ", "ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "Ꮶ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "t", "ʊ", "ʋ",
                    "ա", "x", "ʏ", "ʐ"};
        } else if (nameFont.equals(Constant.FONT_CURLS)) {
            return new CharSequence[]{"a͠", "b͠", "c͠", "d͠", "e͠", "f͠", "g͠", "h͠", "i͠", "j͠", "k͠", "l͠", "m͠", "n͠", "o͠", "p͠", "q͠", "r͠",
                    "s͠", "t͠", "u͠", "v͠", "w͠", "x͠", "y͠", "z͠", "A͠", "B͠", "C͠", "D͠", "E͠", "F͠", "G͠", "H͠", "I͠", "J͠", "K͠", "L͠", "M͠",
                    "N͠", "O͠", "P͠", "Q͠", "R͠", "S͠", "T͠", "U͠", "V͠", "W͠", "X͠", "Y͠", "Z͠", "͠"};
        } else if (nameFont.equals(Constant.FONT_SPARKLE)) {
            return new CharSequence[]{"a͓̽", "b͓̽", "c͓̽", "d͓̽", "e͓̽", "f͓̽", "g͓̽", "h͓̽", "i͓̽", "j͓̽", "k͓̽", "l͓̽", "m͓̽", "n͓̽", "o͓̽", "p͓̽",
                    "q͓̽", "r͓̽", "s͓̽", "t͓̽", "u͓̽", "v͓̽", "w͓̽", "x͓̽", "y͓̽", "z͓̽", "A͓̽", "B͓̽", "C͓̽", "D͓̽", "E͓̽", "F͓̽", "G͓̽", "H͓̽",
                    "I͓̽", "J͓̽", "K͓̽", "L͓̽", "M͓̽", "N͓̽", "O͓̽", "P͓̽", "Q͓̽", "R͓̽", "S͓̽", "T͓̽", "U͓̽", "V͓̽", "W͓̽", "X͓̽", "Y͓̽", "Z͓̽",
                    "͓̽"};
        } else if (nameFont.equals(Constant.FONT_UPSIDE)) {
            return new CharSequence[]{"a͎", "b͎", "c͎", "d͎", "e͎", "f͎", "g͎", "h͎", "i͎", "j͎", "k͎", "l͎", "m͎", "n͎", "o͎", "p͎", "q͎", "r͎",
                    "s͎", "t͎", "u͎", "v͎", "w͎", "x͎", "y͎", "z͎", "A͎", "B͎", "C͎", "D͎", "E͎", "F͎", "G͎", "H͎", "I͎", "J͎", "K͎", "L͎", "M͎",
                    "N͎", "O͎", "P͎", "Q͎", "R͎", "S͎", "T͎", "U͎", "V͎", "W͎", "X͎", "Y͎", "Z͎", "͎"};
        } else if (nameFont.equals(Constant.FONT_PEE_WEE)) {
            return new CharSequence[]{"ѧ", "ɞ", "ċ", "Ԁ", "є", "ғ", "ɢ", "һ", "ı", "j", "ҡ", "ʟ", "ṃ", "ṅ", "ȏ", "ƿ", "զ", "я", "ṡ", "ṭ", "ȗ", "ṿ",
                    "ẇ", "×", "ʏ", "ẓ", "ѧ", "ɞ", "ċ", "Ԁ", "є", "ғ", "ɢ", "һ", "ı", "j", "ҡ", "ʟ", "ṃ", "ṅ", "ȏ", "ƿ", "զ", "я", "ṡ", "ṭ", "ȗ", "ṿ",
                    "ẇ", "×", "ʏ", "ẓ"};
        } else if (nameFont.equals(Constant.FONT_IM_NINJA)) {
            return new CharSequence[]{"ﾑ", "乃", "c", "d", "乇", "ｷ", "g", "ん", "ﾉ", "ﾌ", "ズ", "ﾚ", "ʍ", "刀", "O", "ｱ", "q", "尺", "丂", "ｲ", "u", "√",
                    "w", "ﾒ", "ﾘ", "乙", "ﾑ", "乃", "c", "d", "乇", "ｷ", "g", "ん", "ﾉ", "ﾌ", "ズ", "ﾚ", "ʍ", "刀", "O", "ｱ", "q", "尺", "丂", "ｲ", "u", "√",
                    "w", "ﾒ", "ﾘ", "乙"};
        } else if (nameFont.equals(Constant.FONT_BLUE_EYES)) {
            return new CharSequence[]{"🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜", "🅝", "🅞", "🅟", "🅠", "🅡",
                    "🅢", "🅣", "🅤", "🅥", "🅦", "🅧", "🅨", "🅩", "🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜",
                    "🅝", "🅞", "🅟", "🅠", "🅡", "🅢", "🅣", "🅤", "🅥", "🅦", "🅧", "🅨", "🅩"};
        } else if (nameFont.equals(Constant.FONT_MON_TEY)) {
            return new CharSequence[]{"Ꭿ", "Ᏸ", "Ꮳ", "Ꮄ", "Ꮛ", "Ꮀ", "Ꮆ", "Ꮒ", "i", "Ꮰ", "Ꮶ", "l", "m", "Ꮑ", "Ꮻ", "Ꮅ", "Ꮔ", "ᖇ", "Ꭶ", "Ꮏ", "Ꮜ", "Ꮙ",
                    "Ꮿ", "ﾒ", "Ꭹ", "Ꮓ", "Ꭿ", "Ᏸ", "Ꮳ", "Ꮄ", "Ꮛ", "Ꮀ", "Ꮆ", "Ꮒ", "i", "Ꮰ", "Ꮶ", "l", "m", "Ꮑ", "Ꮻ", "Ꮅ", "Ꮔ", "ᖇ", "Ꭶ", "Ꮏ", "Ꮜ", "Ꮙ",
                    "Ꮿ", "ﾒ", "Ꭹ", "Ꮓ"};
        } else if (nameFont.equals(Constant.FONT_SWORD_LINER)) {
            return new CharSequence[]{"a⃒", "b⃒", "c⃒", "d⃒", "e⃒", "f⃒", "g⃒", "h⃒", "i⃒", "j⃒", "k⃒", "l⃒", "m⃒", "n⃒", "o⃒", "p⃒", "q⃒", "r⃒",
                    "s⃒", "t⃒", "u⃒", "v⃒", "w⃒", "x⃒", "y⃒", "z⃒", "A⃒", "B⃒", "C⃒", "D⃒", "E⃒", "F⃒", "G⃒", "H⃒", "I⃒", "J⃒", "K⃒", "L⃒", "M⃒",
                    "N⃒", "O⃒", "P⃒", "Q⃒", "R⃒", "S⃒", "T⃒", "U⃒", "V⃒", "W⃒", "X⃒", "Y⃒", "Z⃒", "⃒"};
        } else if (nameFont.equals(Constant.FONT_FLIPPER)) {
            return new CharSequence[]{"∀", "♭", "ḉ", "∂", "ε", "ḟ", "ℊ", "н", "ḯ", "ʝ", "ḱ", "ʟ", "ღ", "η", "ø", "℘", "ⓠ", "я", "﹩", "⊥", "ʊ", "ṽ",
                    "ẘ", "✖", "¥", "ℨ", "∀", "♭", "ḉ", "∂", "ε", "ḟ", "ℊ", "н", "ḯ", "ʝ", "ḱ", "ʟ", "ღ", "η", "ø", "℘", "ⓠ", "я", "﹩", "⊥", "ʊ", "ṽ",
                    "ẘ", "✖", "¥", "ℨ"};
        } else if (nameFont.equals(Constant.FONT_INFINITY)) {
            return new CharSequence[]{"a͚", "b͚", "c͚", "d͚", "e͚", "f͚", "g͚", "h͚", "i͚", "j͚", "k͚", "l͚", "m͚", "n͚", "o͚", "p͚", "q͚", "r͚",
                    "s͚", "t͚", "u͚", "v͚", "w͚", "x͚", "y͚", "z͚", "A͚", "B͚", "C͚", "D͚", "E͚", "F͚", "G͚", "H͚", "I͚", "J͚", "K͚", "L͚", "M͚",
                    "N͚", "O͚", "P͚", "Q͚", "R͚", "S͚", "T͚", "U͚", "V͚", "W͚", "X͚", "Y͚", "Z͚", "͚"};
        } else if (nameFont.equals(Constant.FONT_GIORGIO_LOGY)) {
            return new CharSequence[]{"α", "ɓ", "ɕ", "δ", "ε", "ƒ", "ɡ", "հ", "ί", "յ", "Ƙ", "ʆ", "ʍ", "η", "σ", "Թ", "զ", "ɾ", "⑀", "ϯ", "մ", "ѵ",
                    "ϖ", "x", "ψ", "Հ", "α", "ɓ", "ɕ", "δ", "ε", "ƒ", "ɡ", "հ", "ί", "յ", "Ƙ", "ʆ", "ʍ", "η", "σ", "Թ", "զ", "ɾ", "⑀", "ϯ", "մ", "ѵ",
                    "ϖ", "x", "ψ", "Հ"};
        } else if (nameFont.equals(Constant.FONT_SANS_SKRIT)) {
            return new CharSequence[]{"å", "ɞ", "ċ", "Ԁ", "є", "ғ", "ɢ", "һ", "ı", "j", "ҡ", "Ŀ", "ṃ", "ṅ", "ọ", "ƿ", "q", "ŗ", "ṡ", "ṭ", "ȗ", "ṿ",
                    "ẇ", "×", "ʏ", "ẓ", "å", "ɞ", "ċ", "Ԁ", "є", "ғ", "ɢ", "һ", "ı", "j", "ҡ", "Ŀ", "ṃ", "ṅ", "ọ", "ƿ", "q", "ŗ", "ṡ", "ṭ", "ȗ", "ṿ",
                    "ẇ", "×", "ʏ", "ẓ"};
        } else if (nameFont.equals(Constant.FONT_ANGER)) {
            return new CharSequence[]{"a̬̤̯", "b̬̤̯", "c̬̤̯", "d̬̤̯", "e̬̤̯", "f̬̤̯", "g̬̤̯", "h̬̤̯", "i̬̤̯", "j̬̤̯", "k̬̤̯", "l̬̤̯", "m̬̤̯", "n̬̤̯",
                    "o̬̤̯", "p̬̤̯", "q̬̤̯", "r̬̤̯", "s̬̤̯", "t̬̤̯", "u̬̤̯", "v̬̤̯", "w̬̤̯", "x̬̤̯", "y̬̤̯", "z̬̤̯", "A̬̤̯", "B̬̤̯", "C̬̤̯", "D̬̤̯",
                    "E̬̤̯", "F̬̤̯", "G̬̤̯", "H̬̤̯", "I̬̤̯", "J̬̤̯", "K̬̤̯", "L̬̤̯", "M̬̤̯", "N̬̤̯", "O̬̤̯", "P̬̤̯", "Q̬̤̯", "R̬̤̯", "S̬̤̯", "T̬̤̯",
                    "U̬̤̯", "V̬̤̯", "W̬̤̯", "X̬̤̯", "Y̬̤̯", "Z̬̤̯", "̬̤̯"};
        } else if (nameFont.equals(Constant.FONT_TINY_CAPS)) {
            return new CharSequence[]{"ᴀ", "ʙ", "ᴄ", "ᴅ", "ᴇ", "ғ", "ɢ", "ʜ", "ɪ", "ᴊ", "ᴋ", "ʟ", "ᴍ", "ɴ", "ᴏ", "ᴘ", "ǫ", "ʀ", "s", "ᴛ", "ᴜ", "ᴠ",
                    "ᴡ", "x", "ʏ", "ᴢ", "ᴀ", "ʙ", "ᴄ", "ᴅ", "ᴇ", "ғ", "ɢ", "ʜ", "ɪ", "ᴊ", "ᴋ", "ʟ", "ᴍ", "ɴ", "ᴏ", "ᴘ", "ǫ", "ʀ", "s", "ᴛ", "ᴜ", "ᴠ",
                    "ᴡ", "x", "ʏ", "ᴢ"};
        } else if (nameFont.equals(Constant.FONT_JAKAS)) {
            return new CharSequence[]{"ɑ", "ɓ", "ƈ", "ɗ", "ꍟ", "ʄ", "ɠ", "ɧ", "ꀤ", "ꀭ", "ƙ", "ɭ", "ɱ", "ɳ", "ꂦ", "ƥ", "ǫ", "ɽ", "ʂ", "ʈ", "ʋ", "ᐯ",
                    "ɯ", "ꊼ", "ɣ", "ʐ", "ɑ", "ɓ", "ƈ", "ɗ", "ꍟ", "ʄ", "ɠ", "ɧ", "ꀤ", "ꀭ", "ƙ", "ɭ", "ɱ", "ɳ", "ꂦ", "ƥ", "ǫ", "ɽ", "ʂ", "ʈ", "ʋ", "ᐯ",
                    "ɯ", "ꊼ", "ɣ", "ʐ"};
        } else if (nameFont.equals(Constant.FONT_NWOD_EDIT_PU)) {
            return new CharSequence[]{"ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ı", "ɾ", "ʞ", "ʃ", "ɯ", "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ",
                    "ʍ", "x", "ʎ", "z", "∀", "B", "Ɔ", "p", "Ǝ", "Ⅎ", "פ", "H", "I", "ſ", "ʞ", "˥", "W", "N", "O", "Ԁ", "b", "ɹ", "S", "ʇ", "∩", "Λ",
                    "M", "χ", "⅄", "Z"};
        } else if (nameFont.equals(Constant.FONT_HIGHLIGHT_ME)) {
            return new CharSequence[]{"a̠", "b̠", "c̠", "d̠", "e̠", "f̠", "g̠", "h̠", "i̠", "j̠", "k̠", "l̠", "m̠", "n̠", "o̠", "p̠", "q̠", "r̠",
                    "s̠", "t̠", "u̠", "v̠", "w̠", "x̠", "y̠", "z̠", "A̠", "B̠", "C̠", "D̠", "E̠", "F̠", "G̠", "H̠", "I̠", "J̠", "K̠", "L̠", "M̠",
                    "N̠", "O̠", "P̠", "Q̠", "R̠", "S̠", "T̠", "U̠", "V̠", "W̠", "X̠", "Y̠", "Z̠", "̠"};
        } else if (nameFont.equals(Constant.FONT_QUESTION)) {
            return new CharSequence[]{"ả", "b̉", "c̉", "d̉", "ẻ", "f̉", "g̉", "h̉", "ỉ", "j̉", "k̉", "l̉", "m̉", "n̉", "ỏ", "p̉", "q̉", "r̉",
                    "s̉", "t̉", "ủ", "v̉", "w̉", "x̉", "ỷ", "z̉", "Ả", "B̉", "C̉", "D̉", "Ẻ", "F̉", "G̉", "H̉", "Ỉ", "J̉", "K̉", "L̉", "M̉",
                    "N̉", "Ỏ", "P̉", "Q̉", "R̉", "S̉", "T̉", "Ủ", "V̉", "W̉", "X̉", "Ỷ", "Z̉", "̉"};
        } else if (nameFont.equals(Constant.FONT_HOTSPOT)) {
            return new CharSequence[]{"a͒", "b͒", "c͒", "d͒", "e͒", "f͒", "g͒", "h͒", "i͒", "j͒", "k͒", "l͒", "m͒", "n͒", "o͒", "p͒", "q͒", "r͒",
                    "s͒", "t͒", "u͒", "v͒", "w͒", "x͒", "y͒", "z͒", "A͒", "B͒", "C͒", "D͒", "E͒", "F͒", "G͒", "H͒", "I͒", "J͒", "K͒", "L͒", "M͒",
                    "N͒", "O͒", "P͒", "Q͒", "R͒", "S͒", "T͒", "U͒", "V͒", "W͒", "X͒", "Y͒", "Z͒", "͒"};
        } else if (nameFont.equals(Constant.FONT_FROZEN)) {
            return new CharSequence[]{"a༙", "b༙", "c༙", "d༙", "e༙", "f༙", "g༙", "h༙", "i༙", "j༙", "k༙", "l༙", "m༙", "n༙", "o༙", "p༙", "q༙", "r༙",
                    "s༙", "t༙", "u༙", "v༙", "w༙", "x༙", "y༙", "z༙", "A༙", "B༙", "C༙", "D༙", "E༙", "F༙", "G༙", "H༙", "I༙", "J༙", "K༙", "L༙", "M༙",
                    "N༙", "O༙", "P༙", "Q༙", "R༙", "S༙", "T༙", "U༙", "V༙", "W༙", "X༙", "Y༙", "Z༙"};
        } else if (nameFont.equals(Constant.FONT_BUDDHA)) {
            return new CharSequence[]{"aྂ", "bྂ", "cྂ", "dྂ", "eྂ", "fྂ", "gྂ", "hྂ", "iྂ", "jྂ", "kྂ", "lྂ", "mྂ", "nྂ", "oྂ", "pྂ", "qྂ", "rྂ",
                    "sྂ", "tྂ", "uྂ", "vྂ", "wྂ", "xྂ", "yྂ", "zྂ", "Aྂ", "Bྂ", "Cྂ", "Dྂ", "Eྂ", "Fྂ", "Gྂ", "Hྂ", "Iྂ", "Jྂ", "Kྂ", "Lྂ", "Mྂ",
                    "Nྂ", "Oྂ", "Pྂ", "Qྂ", "Rྂ", "Sྂ", "Tྂ", "Uྂ", "Vྂ", "Wྂ", "Xྂ", "Yྂ", "Zྂ", "ྂ"};
        } else if (nameFont.equals(Constant.FONT_EMPIRE_AGC)) {
            return new CharSequence[]{"α", "Ϧ", "ͼ", "δ", "ϵ", "f", "ϭ", "h", "ῖ", "j", "k", "l", "ϻ", "ͷ", "ϴ", "ϼ", "ϑ", "r", "ϩ", "ϯ", "ῠ", "ν",
                    "ϣ", "x", "ϒ", "ϟ", "α", "Ϧ", "ͼ", "δ", "ϵ", "f", "ϭ", "h", "ῖ", "j", "k", "l", "ϻ", "ͷ", "ϴ", "ϼ", "ϑ", "r", "ϩ", "ϯ", "ῠ", "ν",
                    "ϣ", "x", "ϒ", "ϟ"};
        } else if (nameFont.equals(Constant.FONT_TYPEWRITER)) {
            return new CharSequence[]{"𝚊", "𝚋", "𝚌", "𝚍", "𝚎", "𝚏", "𝚐", "𝚑", "𝚒", "𝚓", "𝚔", "𝚕", "𝚖", "𝚗", "𝚘", "𝚙", "𝚚", "𝚛",
                    "𝚜", "𝚝", "𝚞", "𝚟", "𝚠", "𝚡", "𝚢", "𝚣", "𝙰", "𝙱", "𝙲", "𝙳", "𝙴", "𝙵", "𝙶", "𝙷", "𝙸", "𝙹", "𝙺", "𝙻", "𝙼",
                    "𝙽", "𝙾", "𝙿", "𝚀", "𝚁", "𝚂", "𝚃", "𝚄", "𝚅", "𝚆", "𝚇", "𝚈", "𝚉"};
        } else if (nameFont.equals(Constant.FONT_DOUBLER_TRUCK)) {
            return new CharSequence[]{"𝕒", "𝕓", "𝕔", "𝕕", "𝕖", "𝕗", "𝕘", "𝕙", "𝕚", "𝕛", "𝕜", "𝕝", "𝕞", "𝕟", "𝕠", "𝕡", "𝕢", "𝕣",
                    "𝕤", "𝕥", "𝕦", "𝕧", "𝕨", "𝕩", "𝕪", "𝕫", "𝔸", "𝔹", "ℂ", "𝔻", "𝔼", "𝔽", "𝔾", "ℍ", "𝕀", "𝕁", "𝕂", "𝕃", "𝕄", "ℕ",
                    "𝕆", "ℙ", "ℚ", "ℝ", "𝕊", "𝕋", "𝕌", "𝕍", "𝕎", "𝕏", "𝕐", "ℤ"};
        } else if (nameFont.equals(Constant.FONT_FRACTURE)) {
            return new CharSequence[]{"𝔞", "𝔟", "𝔠", "𝔡", "𝔢", "𝔣", "𝔤", "𝔥", "𝔦", "𝔧", "𝔨", "𝔩", "𝔪", "𝔫", "𝔬", "𝔭", "𝔮", "𝔯",
                    "𝔰", "𝔱", "𝔲", "𝔳", "𝔴", "𝔵", "𝔶", "𝔷", "𝔄", "𝔅", "ℭ", "𝔇", "𝔈", "𝔉", "𝔊", "ℌ", "ℑ", "𝔍", "𝔎", "𝔏", "𝔐", "𝔑",
                    "𝔒", "𝔓", "𝔔", "ℜ", "𝔖", "𝔗", "𝔘", "ℭ", "𝔚", "𝔛", "𝔜", "ℨ"};
        } else if (nameFont.equals(Constant.FONT_FRACTURE_BOLD)) {
            return new CharSequence[]{"𝖆", "𝖇", "𝖈", "𝖉", "𝖊", "𝖋", "𝖌", "𝖍", "𝖎", "𝖏", "𝖐", "𝖑", "𝖒", "𝖓", "𝖔", "𝖕", "𝖖", "𝖗",
                    "𝖘", "𝖙", "𝖚", "𝖛", "𝖜", "𝖝", "𝖞", "𝖟", "𝕬", "𝕭", "𝕮", "𝕯", "𝕰", "𝕱", "𝕲", "𝕳", "𝕴", "𝕵", "𝕶", "𝕷", "𝕸",
                    "𝕹", "𝕺", "𝕻", "𝕼", "𝕽", "𝕾", "𝕿", "𝖀", "𝖁", "𝖂", "𝖃", "𝖄", "𝖅"};
        } else if (nameFont.equals(Constant.FONT_RUSSIAN)) {
            return new CharSequence[]{"Д", "Б", "Ҁ", "ↁ", "Є", "F", "Б", "Н", "І", "Ј", "Ќ", "L", "М", "И", "Ф", "Р", "Q", "Я", "Ѕ", "Г", "Ц", "V",
                    "Щ", "Ж", "Ч", "Z", "Д", "Б", "Ҁ", "ↁ", "Є", "F", "Б", "Н", "І", "Ј", "Ќ", "L", "М", "И", "Ф", "Р", "Q", "Я", "Ѕ", "Г", "Ц", "V",
                    "Щ", "Ж", "Ч", "Z"};
        } else if (nameFont.equals(Constant.FONT_RUNES)) {
            return new CharSequence[]{"ል", "ጌ", "ር", "ዕ", "ቿ", "ቻ", "ኗ", "ዘ", "ጎ", "ጋ", "ጕ", "ረ", "ጠ", "ክ", "ዐ", "የ", "ዒ", "ዪ", "ነ", "ፕ", "ሁ", "ሀ",
                    "ሠ", "ሸ", "ሃ", "ጊ", "ል", "ጌ", "ር", "ዕ", "ቿ", "ቻ", "ኗ", "ዘ", "ጎ", "ጋ", "ጕ", "ረ", "ጠ", "ክ", "ዐ", "የ", "ዒ", "ዪ", "ነ", "ፕ", "ሁ", "ሀ",
                    "ሠ", "ሸ", "ሃ", "ጊ"};
        } else if (nameFont.equals(Constant.FONT_DOTS)) {
            return new CharSequence[]{"a`", "b`", "c`", "d`", "e`", "f`", "g`", "h`", "i`", "j`", "k`", "l`", "m`", "n`", "o`", "p`", "q`", "r`",
                    "s`", "t`", "u`", "v`", "w`", "x`", "y`", "z`", "A`", "B`", "C`", "D`", "E`", "F`", "G`", "H`", "I`", "J`", "K`", "L`", "M`",
                    "N`", "O`", "P`", "Q`", "R`", "S`", "T`", "U`", "V`", "W`", "X`", "Y`", "Z`", "`"};
        } else if (nameFont.equals(Constant.FONT_STROKED)) {
            return new CharSequence[]{"Ⱥ", "Ƀ", "Ȼ", "Đ", "Ɇ", "F", "Ǥ", "Ħ", "Ɨ", "Ɉ", "Ꝁ", "Ł", "M", "N", "Ø", "Ᵽ", "Ꝗ", "Ɍ", "S", "Ŧ", "ᵾ", "V",
                    "W", "X", "Ɏ", "Ƶ", "Ⱥ", "Ƀ", "Ȼ", "Đ", "Ɇ", "F", "Ǥ", "Ħ", "Ɨ", "Ɉ", "Ꝁ", "Ł", "M", "N", "Ø", "Ᵽ", "Ꝗ", "Ɍ", "S", "Ŧ", "ᵾ", "V",
                    "W", "X", "Ɏ", "Ƶ"};
        } else if (nameFont.equals(Constant.FONT_BLACK_CHODE)) {
            return new CharSequence[]{"a⃘", "b⃘", "c⃘", "d⃘", "e⃘", "f⃘", "g⃘", "h⃘", "i⃘", "j⃘", "k⃘", "l⃘", "m⃘", "n⃘", "o⃘", "p⃘", "q⃘", "r⃘",
                    "s⃘", "t⃘", "u⃘", "v⃘", "w⃘", "x⃘", "y⃘", "z⃘", "a⃘", "b⃘", "c⃘", "d⃘", "e⃘", "f⃘", "g⃘", "h⃘", "i⃘", "j⃘", "k⃘", "l⃘", "m⃘",
                    "n⃘", "o⃘", "p⃘", "q⃘", "r⃘", "s⃘", "t⃘", "u⃘", "v⃘", "w⃘", "x⃘", "y⃘", "z⃘"};
        } else if (nameFont.equals(Constant.FONT_HUNGARIAN)) {
            return new CharSequence[]{"𐌀", "Ⴊ", "Ꮳ", "მ", "Ꮛ", "f", "Ᏻ", "Ћ", "i", "ქ", "k", "l", "ო", "Ⴖ", "ტ", "Ⴒ", "Ⴍ", "R", "Ⴝ", "𐌕", "Ⴎ", "V",
                    "w", "ჯ", "Ⴤ", "ɀ", "𐌀", "Ⴊ", "Ꮳ", "მ", "Ꮛ", "f", "Ᏻ", "Ћ", "i", "ქ", "k", "l", "ო", "Ⴖ", "ტ", "Ⴒ", "Ⴍ", "R", "Ⴝ", "𐌕", "Ⴎ",
                    "V", "w", "ჯ", "Ⴤ", "ɀ"};
        } else if (nameFont.equals(Constant.FONT_WAY_COOL)) {
            return new CharSequence[]{"Ѧ", "♭", "¢", "∂", "℮", "ḟ", "ℊ", "ℌ", "ї", "ʝ", "к", "ℓ", "м", "η", "◎", "℘", "ⓠ", "ґ", "﹩", "†", "ʊ", "ṽ",
                    "ẘ", "ϰ", "¥", "ẕ", "Ѧ", "♭", "¢", "∂", "℮", "ḟ", "ℊ", "ℌ", "ї", "ʝ", "к", "ℓ", "м", "η", "◎", "℘", "ⓠ", "ґ", "﹩", "†", "ʊ", "ṽ",
                    "ẘ", "ϰ", "¥", "ẕ"};
        } else if (nameFont.equals(Constant.FONT_SA_MUENZ)) {
            return new CharSequence[]{"ศ", "๖", "໒", "อ", "ཛ", "f", "g", "ཏ", "ར", "j", "K", "ʆ", "ฅ", "ས", "๑", "♇", "q", "ཞ", "ຮ", "₮", "ມ", "v",
                    "ཡ", "×", "ƴ", "ƶ", "ศ", "๖", "໒", "อ", "ཛ", "f", "g", "ཏ", "ར", "j", "K", "ʆ", "ฅ", "ས", "๑", "♇", "q", "ཞ", "ຮ", "₮", "ມ", "v",
                    "ཡ", "×", "ƴ", "ƶ"};
        } else if (nameFont.equals(Constant.FONT_RAM_TRACK)) {
            return new CharSequence[]{"a̸͟͞", "b̸͟͞", "c̸͟͞", "d̸͟͞", "e̸͟͞", "f̸͟͞", "g̸͟͞", "h̸͟͞", "i̸͟͞", "j̸͟͞", "k̸͟͞", "l̸͟͞", "m̸͟͞", "n̸͟͞",
                    "o̸͟͞", "p̸͟͞", "q̸͟͞", "r̸͟͞", "s̸͟͞", "t̸͟͞", "u̸͟͞", "v̸͟͞", "w̸͟͞", "x̸͟͞", "y̸͟͞", "z̸͟͞", "A̸͟͞", "B̸͟͞", "C̸͟͞", "D̸͟͞",
                    "E̸͟͞", "F̸͟͞", "G̸͟͞", "H̸͟͞", "I̸͟͞", "J̸͟͞", "K̸͟͞", "L̸͟͞", "M̸͟͞", "N̸͟͞", "O̸͟͞", "P̸͟͞", "Q̸͟͞", "R̸͟͞", "S̸͟͞", "T̸͟͞",
                    "U̸͟͞", "V̸͟͞", "W̸͟͞", "X̸͟͞", "Y̸͟͞", "Z̸͟͞", "̸͟͞"};
        } /*else if (nameFont.equals(Constant.FONT_STAMP)) {
            return new CharSequence[]{"🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼", "🄽", "🄾", "🄿", "🅀", "🅁",
                    "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉", "🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼",
                    "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉"};
        } */else if (nameFont.equals(Constant.FONT_THIS_HULA)) {
            return new CharSequence[]{"ᾰ", "♭", "ḉ", "ᖱ", "ḙ", "ḟ", "❡", "ℏ", "!", "♩", "к", "ℓ", "Պ", "ℵ", "✺", "℘", "ǭ", "Ի", "ṧ", "т", "ṳ", "ṽ",
                    "ω", "✘", "⑂", "ℨ", "ᾰ", "♭", "ḉ", "ᖱ", "ḙ", "ḟ", "❡", "ℏ", "!", "♩", "к", "ℓ", "Պ", "ℵ", "✺", "℘", "ǭ", "Ի", "ṧ", "т", "ṳ", "ṽ",
                    "ω", "✘", "⑂", "ℨ"};
        } else if (nameFont.equals(Constant.FONT_KUNG_FU)) {
            return new CharSequence[]{"ศ", "๖", "໒", "อ", "ཛ", "f", "g", "ཏ", "ར", "j", "K", "ʆ", "ฅ", "ས", "๑", "♇", "q", "ཞ", "ຮ", "₮", "ມ", "v",
                    "ཡ", "×", "ƴ", "ƶ", "ศ", "๖", "໒", "อ", "ཛ", "f", "g", "ཏ", "ར", "j", "K", "ʆ", "ฅ", "ས", "๑", "♇", "q", "ཞ", "ຮ", "₮", "ມ", "v",
                    "ཡ", "×", "ƴ", "ƶ"};
        } else if (nameFont.equals(Constant.FONT_HAPPY_FACE)) {
            return new CharSequence[]{"a̤̮", "b̤̮", "c̤̮", "d̤̮", "e̤̮", "f̤̮", "g̤̮", "h̤̮", "i̤̮", "j̤̮", "k̤̮", "l̤̮", "m̤̮", "n̤̮", "o̤̮", "p̤̮",
                    "q̤̮", "r̤̮", "s̤̮", "t̤̮", "ṳ̮", "v̤̮", "w̤̮", "x̤̮", "y̤̮", "z̤̮", "A̤̮", "B̤̮", "C̤̮", "D̤̮", "E̤̮", "F̤̮", "G̤̮", "H̤̮",
                    "I̤̮", "J̤̮", "K̤̮", "L̤̮", "M̤̮", "N̤̮", "O̤̮", "P̤̮", "Q̤̮", "R̤̮", "S̤̮", "T̤̮", "Ṳ̮", "V̤̮", "W̤̮", "X̤̮", "Y̤̮", "Z̤̮",
                    "̤̮"};
        } else if (nameFont.equals(Constant.FONT_ROMTNUM)) {
            return new CharSequence[]{"Ꮨ", "Ᏸ", "Ꮸ", "Ꭰ", "Ꮛ", "F", "Ꮆ", "H", "I", "Ꮰ", "K", "L", "M", "Ꮑ", "Ꭷ", "Ꭾ", "Q", "R", "Ꭶ", "T", "U", "Ꮴ",
                    "Ꮚ", "X", "Ꮍ", "Z", "Ꮨ", "Ᏸ", "Ꮸ", "Ꭰ", "Ꮛ", "F", "Ꮆ", "H", "I", "Ꮰ", "K", "L", "M", "Ꮑ", "Ꭷ", "Ꭾ", "Q", "R", "Ꭶ", "T", "U", "Ꮴ",
                    "Ꮚ", "X", "Ꮍ", "Z"};
        } else if (nameFont.equals(Constant.FONT_DOUBLE_LINE)) {
            return new CharSequence[]{"͟a͟", "͟b͟", "͟c͟", "͟d͟", "͟e͟", "͟f͟", "͟g͟", "͟h͟", "͟i͟", "͟j͟", "͟k͟", "͟l͟", "͟m͟", "͟n͟", "͟o͟", "͟p͟",
                    "͟q͟", "͟r͟", "͟s͟", "͟t͟", "͟u͟", "͟v͟", "͟w͟", "͟x͟", "͟y͟", "͟z͟͟", "͟A͟͟", "͟B͟͟", "͟C͟͟", "͟D͟͟", "͟E͟͟", "͟F͟͟", "͟G͟͟",
                    "͟H͟͟",
                    "͟I͟͟", "͟J͟͟", "͟K͟͟", "͟L͟͟", "͟M͟͟", "͟N͟͟", "͟O͟͟", "͟P͟͟", "͟Q͟͟", "͟R͟͟", "͟S͟͟", "͟T͟", "͟U͟", "͟V͟", "͟W͟", "͟X͟", "͟Y͟",
                    "͟Z͟͟"};
        } else if (nameFont.equals(Constant.FONT_MOGLI)) {
            return new CharSequence[]{"ᗛ", "ᗷ", "Ʋ", "Đ", "ℨ", "F", "Ꮆ", "ℌ", "Ĭ", "ℑ", "Ƙ", "Ĺ", "Ṁ", "Ŋ", "Ɵ", "Ƥ", "Q", "Ʀ", "Ṩ", "Ṫ", "Ự", "Ʋ",
                    "ϖ", "Ẍ", "Ƴ", "Ƶ", "ᗛ", "ᗷ", "Ʋ", "Đ", "ℨ", "F", "Ꮆ", "ℌ", "Ĭ", "ℑ", "Ƙ", "Ĺ", "Ṁ", "Ŋ", "Ɵ", "Ƥ", "Q", "Ʀ", "Ṩ", "Ṫ", "Ự", "Ʋ",
                    "ϖ", "Ẍ", "Ƴ", "Ƶ"};
        } else if (nameFont.equals(Constant.FONT_DRAGON)) {
            return new CharSequence[]{"ค", "๒", "ς", "๔", "є", "Ŧ", "g", "♄", "ί", "j", "ƙ", "l", "๓", "ภ", "๏", "Թ", "ợ", "г", "ร", "t", "ย", "v",
                    "ฬ", "x", "y", "z", "ค", "๒", "ς", "๔", "є", "Ŧ", "g", "♄", "ί", "j", "ƙ", "l", "๓", "ภ", "๏", "Թ", "ợ", "г", "ร", "t", "ย", "v",
                    "ฬ", "x", "y", "z"};
        } else if (nameFont.equals(Constant.FONT_SAMBA_WAYS)) {
            return new CharSequence[]{"ɑ", "ɓ", "ɕ", "Ƌ", "ɛ", "ʄ", "ɠ", "ɦ", "ɨ", "ϳ", "ƙ", "ƚ", "ɱ", "ɲ", "ɵ", "ϼ", "ɋ", "ɾ", "ʂ", "ʈ", "ự", "ʋ",
                    "ϣ", "ӝ", "џ", "ʑ", "ɑ", "ɓ", "ɕ", "Ƌ", "ɛ", "ʄ", "ɠ", "ɦ", "ɨ", "ϳ", "ƙ", "ƚ", "ɱ", "ɲ", "ɵ", "ϼ", "ɋ", "ɾ", "ʂ", "ʈ", "ự", "ʋ",
                    "ϣ", "ӝ", "џ", "ʑ"};
        } else if (nameFont.equals(Constant.FONT_ROUND_STAMP)) {
            return new CharSequence[]{"a⃠", "b⃠", "c⃠", "d⃠", "e⃠", "f⃠", "g⃠", "h⃠", "i⃠", "j⃠", "k⃠", "l⃠", "m⃠", "n⃠", "o⃠", "p⃠", "q⃠", "r⃠",
                    "s⃠", "t⃠", "u⃠", "v⃠", "w⃠", "x⃠", "y⃠", "z⃠", "A⃠", "B⃠", "C⃠", "D⃠", "E⃠", "F⃠", "G⃠", "H⃠", "I⃠", "J⃠", "K⃠", "L⃠", "M⃠",
                    "N⃠", "O⃠", "P⃠", "Q⃠", "R⃠", "S⃠", "T⃠", "U⃠", "V⃠", "W⃠", "X⃠", "Y⃠", "Z⃠", "⃠"};
        } else if (nameFont.equals(Constant.FONT_BRIDGE)) {
            return new CharSequence[]{"a̺͆", "b̺͆", "c̺͆", "d̺͆", "e̺͆", "f̺͆", "g̺͆", "h̺͆", "i̺͆", "j̺͆", "k̺͆", "l̺͆", "m̺͆", "n̺͆", "o̺͆", "p̺͆",
                    "q̺͆", "r̺͆", "s̺͆", "t̺͆", "u̺͆", "v̺͆", "w̺͆", "x̺͆", "y̺͆", "z̺͆", "A̺͆", "B̺͆", "C̺͆", "D̺͆", "E̺͆", "F̺͆", "G̺͆", "H̺͆",
                    "I̺͆", "J̺͆", "K̺͆", "L̺͆", "M̺͆", "N̺͆", "O̺͆", "P̺͆", "Q̺͆", "R̺͆", "S̺͆", "T̺͆", "U̺͆", "V̺͆", "W̺͆", "X̺͆", "Y̺͆", "Z̺͆",
                    "̺͆"};
        } else if (nameFont.equals(Constant.FONT_PERSHIAN)) {
            return new CharSequence[]{"ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "Ꮶ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "T", "ʊ", "ʋ",
                    "ա", "x", "ʏ", "ʐ", "ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "Ꮶ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "T", "ʊ", "ʋ",
                    "ա", "x", "ʏ", "ʐ"};
        } else if (nameFont.equals(Constant.FONT_SWAGO_LOGY)) {
            return new CharSequence[]{"Ꭿ", "ℬ", "ℂ", "ⅅ", "ℰ", "ℱ", "Ꮆ", "ℋ", "ℐ", "Ꭻ", "Ꮶ", "ℒ", "ℳ", "ℕ", "Ꮎ", "ℙ", "ℚ", "ℛ", "Ѕ", "T", "U", "Ꮙ",
                    "Ꮗ", "X", "Ꮍ", "ℤ", "Ꭿ", "ℬ", "ℂ", "ⅅ", "ℰ", "ℱ", "Ꮆ", "ℋ", "ℐ", "Ꭻ", "Ꮶ", "ℒ", "ℳ", "ℕ", "Ꮎ", "ℙ", "ℚ", "ℛ", "Ѕ", "T", "U", "Ꮙ",
                    "Ꮗ", "X", "Ꮍ", "ℤ"};

            //v 5.5
        }

        //v5.5
        else {
            return getFontVersion5_1(nameFont);
        }

    }

    public CharSequence[] getFontNormal() {
        return new CharSequence[]{"a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v",
                "w", "x", "y", "z", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V",
                "W", "X", "Y", "Z"};
    }

    public CharSequence[] getFontVersion5_1(String nameFont) {
        if (nameFont.equals(Constant.FONT_BRAILLE)) {
            return new CharSequence[]{"⠁", "⠃", "⠉", "⠙", "⠑", "⠋", "⠛", "⠓", "⠊", "⠚", "⠅", "⠇", "⠍", "⠝", "⠕", "⠏", "⠟", "⠗", "⠎", "⠞", "⠥", "⠧", "⠺", "⠭", "⠽", "⠵", "⠁", "⠃", "⠉", "⠙", "⠑", "⠋", "⠛", "⠓", "⠊", "⠚", "⠅", "⠇", "⠍", "⠝", "⠕", "⠏", "⠟", "⠗", "⠎", "⠞", "⠥", "⠧", "⠺", "⠭", "⠽", "⠵"};
        } else if (nameFont.equals(Constant.FONT_HAT)) {
            return new CharSequence[]{"aི", "bི", "cི", "dི", "eི", "fི", "gི", "hི", "iི", "jི", "kི", "lི", "mི", "nི", "oི", "pི", "qི", "rི", "sི", "tི", "uི", "vི", "wི", "xི", "yི", "zི", "Aི", "Bི", "Cི", "Dི", "Eི", "Fི", "Gི", "Hི", "Iི", "Jི", "Kི", "Lི", "Mི", "Nི", "Oི", "Pི", "Qི", "Rི", "Sི", "Tི", "Uི", "Vི", "Wི", "Xི", "Yི", "Zི", "ི"};
        } else if (nameFont.equals(Constant.FONT_TILDE)) {
            return new CharSequence[]{"a̰", "b̰", "c̰", "d̰", "ḛ", "f̰", "g̰", "h̰", "ḭ", "j̰", "k̰", "l̰", "m̰", "n̰", "o̰", "p̰", "q̰", "r̰", "s̰", "t̰", "ṵ", "v̰", "w̰", "x̰", "y̰", "z̰", "A̰", "B̰", "C̰", "D̰", "Ḛ", "F̰", "G̰", "H̰", "Ḭ", "J̰", "K̰", "L̰", "M̰", "N̰", "O̰", "P̰", "Q̰", "R̰", "S̰", "T̰", "Ṵ", "V̰", "W̰", "X̰", "Y̰", "Z̰", "̰"};
        } else if (nameFont.equals(Constant.FONT_UNDERLINE_2)) {
            return new CharSequence[]{"a̳", "b̳", "c̳", "d̳", "e̳", "f̳", "g̳", "h̳", "i̳", "j̳", "k̳", "l̳", "m̳", "n̳", "o̳", "p̳", "q̳", "r̳", "s̳", "t̳", "u̳", "v̳", "w̳", "x̳", "y̳", "z̳", "A̳", "B̳", "C̳", "D̳", "E̳", "F̳", "G̳", "H̳", "I̳", "J̳", "K̳", "L̳", "M̳", "N̳", "O̳", "P̳", "Q̳", "R̳", "S̳", "T̳", "U̳", "V̳", "W̳", "X̳", "Y̳", "Z̳", "̳"};
        } else if (nameFont.equals(Constant.FONT_FRAME)) {
            return new CharSequence[]{"a̺͆", "b̺͆", "c̺͆", "d̺͆", "e̺͆", "f̺͆", "g̺͆", "h̺͆", "i̺͆", "j̺͆", "k̺͆", "l̺͆", "m̺͆", "n̺͆", "o̺͆", "p̺͆", "q̺͆", "r̺͆", "s̺͆", "t̺͆", "u̺͆", "v̺͆", "w̺͆", "x̺͆", "y̺͆", "z̺͆", "A̺͆", "B̺͆", "C̺͆", "D̺͆", "E̺͆", "F̺͆", "G̺͆", "H̺͆", "I̺͆", "J̺͆", "K̺͆", "L̺͆", "M̺͆", "N̺͆", "O̺͆", "P̺͆", "Q̺͆", "R̺͆", "S̺͆", "T̺͆", "U̺͆", "V̺͆", "W̺͆", "X̺͆", "Y̺͆", "Z̺͆", "̺͆"};
        } else if (nameFont.equals(Constant.FONT_MOSAIQ)) {
            return new CharSequence[]{"⫷a⫸", "⫷b⫸", "⫷c⫸", "⫷d⫸", "⫷e⫸", "⫷f⫸", "⫷g⫸", "⫷h⫸", "⫷i⫸", "⫷j⫸", "⫷k⫸", "⫷l⫸", "⫷m⫸", "⫷n⫸", "⫷o⫸", "⫷p⫸", "⫷q⫸", "⫷r⫸", "⫷s⫸", "⫷t⫸", "⫷u⫸", "⫷v⫸", "⫷w⫸", "⫷x⫸", "⫷y⫸", "⫷z⫸", "⫷A⫸", "⫷B⫸", "⫷C⫸", "⫷D⫸", "⫷E⫸", "⫷F⫸", "⫷G⫸", "⫷H⫸", "⫷I⫸", "⫷J⫸", "⫷K⫸", "⫷L⫸", "⫷M⫸", "⫷N⫸", "⫷O⫸", "⫷P⫸", "⫷Q⫸", "⫷R⫸", "⫷S⫸", "⫷T⫸", "⫷U⫸", "⫷V⫸", "⫷W⫸", "⫷X⫸", "⫷Y⫸", "⫷Z⫸"};
        } else if (nameFont.equals(Constant.FONT_IN_LOVE)) {
            return new CharSequence[]{"a❤", "b❤", "c❤", "d❤", "e❤", "f❤", "g❤", "h❤", "i❤", "j❤", "k❤", "l❤", "m❤", "n❤", "o❤", "p❤", "q❤", "r❤", "s❤", "t❤", "u❤", "v❤", "w❤", "x❤", "y❤", "z❤", "A❤", "B❤", "C❤", "D❤", "E❤", "F❤", "G❤", "H❤", "I❤", "J❤", "K❤", "L❤", "M❤", "N❤", "O❤", "P❤", "Q❤", "R❤", "S❤", "T❤", "U❤", "V❤", "W❤", "X❤", "Y❤", "Z❤", "❤"};
        } else if (nameFont.equals(Constant.FONT_LINES)) {
            return new CharSequence[]{"⚟a⚞", "⚟b⚞", "⚟c⚞", "⚟d⚞", "⚟e⚞", "⚟f⚞", "⚟g⚞", "⚟h⚞", "⚟i⚞", "⚟j⚞", "⚟k⚞", "⚟l⚞", "⚟m⚞", "⚟n⚞", "⚟o⚞", "⚟p⚞", "⚟q⚞", "⚟r⚞", "⚟s⚞", "⚟t⚞", "⚟u⚞", "⚟v⚞", "⚟w⚞", "⚟x⚞", "⚟y⚞", "⚟z⚞", "⚟A⚞", "⚟B⚞", "⚟C⚞", "⚟D⚞", "⚟E⚞", "⚟F⚞", "⚟G⚞", "⚟H⚞", "⚟I⚞", "⚟J⚞", "⚟K⚞", "⚟L⚞", "⚟M⚞", "⚟N⚞", "⚟O⚞", "⚟P⚞", "⚟Q⚞", "⚟R⚞", "⚟S⚞", "⚟T⚞", "⚟U⚞", "⚟V⚞", "⚟W⚞", "⚟X⚞", "⚟Y⚞", "⚟Z⚞"};
        } else if (nameFont.equals(Constant.FONT_SHARDS)) {
            return new CharSequence[]{"a༶", "b༶", "c༶", "d༶", "e༶", "f༶", "g༶", "h༶", "i༶", "j༶", "k༶", "l༶", "m༶", "n༶", "o༶", "p༶", "q༶", "r༶", "s༶", "t༶", "u༶", "v༶", "w༶", "x༶", "y༶", "z༶", "A༶", "B༶", "C༶", "D༶", "E༶", "F༶", "G༶", "H༶", "I༶", "J༶", "K༶", "L༶", "M༶", "N༶", "O༶", "P༶", "Q༶", "R༶", "S༶", "T༶", "U༶", "V༶", "W༶", "X༶", "Y༶", "Z༶", "༶"};
        } else if (nameFont.equals(Constant.FONT_DOUBLE_CURLY)) {
            return new CharSequence[]{"⦅a⦆", "⦅b⦆", "⦅c⦆", "⦅d⦆", "⦅e⦆", "⦅f⦆", "⦅g⦆", "⦅h⦆", "⦅i⦆", "⦅j⦆", "⦅k⦆", "⦅l⦆", "⦅m⦆", "⦅n⦆", "⦅o⦆", "⦅p⦆", "⦅q⦆", "⦅r⦆", "⦅s⦆", "⦅t⦆", "⦅u⦆", "⦅v⦆", "⦅w⦆", "⦅x⦆", "⦅y⦆", "⦅z⦆", "⦅A⦆", "⦅B⦆", "⦅C⦆", "⦅D⦆", "⦅E⦆", "⦅F⦆", "⦅G⦆", "⦅H⦆", "⦅I⦆", "⦅J⦆", "⦅K⦆", "⦅L⦆", "⦅M⦆", "⦅N⦆", "⦅O⦆", "⦅P⦆", "⦅Q⦆", "⦅R⦆", "⦅S⦆", "⦅T⦆", "⦅U⦆", "⦅V⦆", "⦅W⦆", "⦅X⦆", "⦅Y⦆", "⦅Z⦆"};
        } else if (nameFont.equals(Constant.FONT_THIN_A)) {
            return new CharSequence[]{"〔a〕", "〔b〕", "〔c〕", "〔d〕", "〔e〕", "〔f〕", "〔g〕", "〔h〕", "〔i〕", "〔j〕", "〔k〕", "〔l〕", "〔m〕", "〔n〕", "〔o〕", "〔p〕", "〔q〕", "〔r〕", "〔s〕", "〔t〕", "〔u〕", "〔v〕", "〔w〕", "〔x〕", "〔y〕", "〔z〕", "〔A〕", "〔B〕", "〔C〕", "〔D〕", "〔E〕", "〔F〕", "〔G〕", "〔H〕", "〔I〕", "〔J〕", "〔K〕", "〔L〕", "〔M〕", "〔N〕", "〔O〕", "〔P〕", "〔Q〕", "〔R〕", "〔S〕", "〔T〕", "〔U〕", "〔V〕", "〔W〕", "〔X〕", "〔Y〕", "〔Z〕"};
        } else if (nameFont.equals(Constant.FONT_ANGUI)) {
            return new CharSequence[]{"《a》", "《b》", "《c》", "《d》", "《e》", "《f》", "《g》", "《h》", "《i》", "《j》", "《k》", "《l》", "《m》", "《n》", "《o》", "《p》", "《q》", "《r》", "《s》", "《t》", "《u》", "《v》", "《w》", "《x》", "《y》", "《z》", "《A》", "《B》", "《C》", "《D》", "《E》", "《F》", "《G》", "《H》", "《I》", "《J》", "《K》", "《L》", "《M》", "《N》", "《O》", "《P》", "《Q》", "《R》", "《S》", "《T》", "《U》", "《V》", "《W》", "《X》", "《Y》", "《Z》"};
        } else if (nameFont.equals(Constant.FONT_DOUBLE)) {
            return new CharSequence[]{"〖a〗", "〖b〗", "〖c〗", "〖d〗", "〖e〗", "〖f〗", "〖g〗", "〖h〗", "〖i〗", "〖j〗", "〖k〗", "〖l〗", "〖m〗", "〖n〗", "〖o〗", "〖p〗", "〖q〗", "〖r〗", "〖s〗", "〖t〗", "〖u〗", "〖v〗", "〖w〗", "〖x〗", "〖y〗", "〖z〗", "〖A〗", "〖B〗", "〖C〗", "〖D〗", "〖E〗", "〖F〗", "〖G〗", "〖H〗", "〖I〗", "〖J〗", "〖K〗", "〖L〗", "〖M〗", "〖N〗", "〖O〗", "〖P〗", "〖Q〗", "〖R〗", "〖S〗", "〖T〗", "〖U〗", "〖V〗", "〖W〗", "〖X〗", "〖Y〗", "〖Z〗"};
        } else if (nameFont.equals(Constant.FONT_BRACE)) {
            return new CharSequence[]{"『a』", "『b』", "『c』", "『d』", "『e』", "『f』", "『g』", "『h』", "『i』", "『j』", "『k』", "『l』", "『m』", "『n』", "『o』", "『p』", "『q』", "『r』", "『s』", "『t』", "『u』", "『v』", "『w』", "『x』", "『y』", "『z』", "『A』", "『B』", "『C』", "『D』", "『E』", "『F』", "『G』", "『H』", "『I』", "『J』", "『K』", "『L』", "『M』", "『N』", "『O』", "『P』", "『Q』", "『R』", "『S』", "『T』", "『U』", "『V』", "『W』", "『X』", "『Y』", "『Z』"};
        } else if (nameFont.equals(Constant.FONT_SEPARATION)) {
            return new CharSequence[]{"a┋", "b┋", "c┋", "d┋", "e┋", "f┋", "g┋", "h┋", "i┋", "j┋", "k┋", "l┋", "m┋", "n┋", "o┋", "p┋", "q┋", "r┋", "s┋", "t┋", "u┋", " v┋", "w┋", "x┋", "y┋", "z┋", "A┋", "B┋", "C┋", "D┋", "E┋", "F┋", "G┋", "H┋", "I┋", "J┋", "K┋", "L┋", "M┋", "N┋", "O┋", "P┋", "Q┋", "R┋", "S┋", "T┋", "U┋", "V┋", "W┋", "X┋", "Y┋", "Z┋", "┋"};
        } else if (nameFont.equals(Constant.FONT_SEPARATION_SQUIGGLY)) {
            return new CharSequence[]{"a⸾", "b⸾", "c⸾", "d⸾", "e⸾", "f⸾", "g⸾", "h⸾", "i⸾", "j⸾", "k⸾", "l⸾", "m⸾", "n⸾", "o⸾", "p⸾", "q⸾", "r⸾", "s⸾", "t⸾", "u⸾", "v⸾", "w⸾", "x⸾", "y⸾", "z⸾", "A⸾", "B⸾", "C⸾", "D⸾", "E⸾", "F⸾", "G⸾", "H⸾", "I⸾", "J⸾", "K⸾", "L⸾", "M⸾", "N⸾", "O⸾", "P⸾", "Q⸾", "R⸾", "S⸾", "T⸾", "U⸾", "V⸾", "W⸾", "X⸾", "Y⸾", "Z⸾", "⸾"};
        } else if (nameFont.equals(Constant.FONT_PIPE_SUP_RIGHT)) {
            return new CharSequence[]{"a╝", "b╝", "c╝", "d╝", "e╝", "f╝", "g╝", "h╝", "i╝", "j╝", "k╝", "l╝", "m╝", "n╝", "o╝", "p╝", "q╝", "r╝", "s╝", "t╝", "u╝", "v╝", "w╝", "x╝", "y╝", "z╝", "A╝", "B╝", "C╝", "D╝", "E╝", "F╝", "G╝", "H╝", "I╝", "J╝", "K╝", "L╝", "M╝", "N╝", "O╝", "P╝", "Q╝", "R╝", "S╝", "T╝", "U╝", "V╝", "W╝", "X╝", "Y╝", "Z╝", "╝"};
        } else if (nameFont.equals(Constant.FONT_PIPE_SUP_LEFT)) {
            return new CharSequence[]{"a╚", "b╚", "c╚", "d╚", "e╚", "f╚", "g╚", "h╚", "i╚", "j╚", "k╚", "l╚", "m╚", "n╚", "o╚", "p╚", "q╚", "r╚", "s╚", "t╚", "u╚", "v╚", "w╚", "x╚", "y╚", "z╚", "A╚", "B╚", "C╚", "D╚", "E╚", "F╚", "G╚", "H╚", "I╚", "J╚", "K╚", "L╚", "M╚", "N╚", "O╚", "P╚", "Q╚", "R╚", "S╚", "T╚", "U╚", "V╚", "W╚", "X╚", "Y╚", "Z╚", "╚"};
        } else if (nameFont.equals(Constant.FONT_THIN_DOWN_LEFT)) {
            return new CharSequence[]{"a╭", "b╭", "c╭", "d╭", "e╭", "f╭", "g╭", "h╭", "i╭", "j╭", "k╭", "l╭", "m╭", "n╭", "o╭", "p╭", "q╭", "r╭", "s╭", "t╭", "u╭", "v╭", "w╭", "x╭", "y╭", "z╭", "A╭", "B╭", "C╭", "D╭", "E╭", "F╭", "G╭", "H╭", "I╭", "J╭", "K╭", "L╭", "M╭", "N╭", "O╭", "P╭", "Q╭", "R╭", "S╭", "T╭", "U╭", "V╭", "W╭", "X╭", "Y╭", "Z╭", "╭"};
        } else if (nameFont.equals(Constant.FONT_THIN_DOWN_RIGHT)) {
            return new CharSequence[]{"a╮", "b╮", "c╮", "d╮", "e╮", "f╮", "g╮", "h╮", "i╮", "j╮", "k╮", "l╮", "m╮", "n╮", "o╮", "p╮", "q╮", "r╮", "s╮", "t╮", "u╮", "v╮", "w╮", "x╮", "y╮", "z╮", "A╮", "B╮", "C╮", "D╮", "E╮", "F╮", "G╮", "H╮", "I╮", "J╮", "K╮", "L╮", "M╮", "N╮", "O╮", "P╮", "Q╮", "R╮", "S╮", "T╮", "U╮", "V╮", "W╮", "X╮", "Y╮", "Z╮", "╮"};
        } else if (nameFont.equals(Constant.FONT_THIN_UP_LEFT)) {
            return new CharSequence[]{"a╰", "b╰", "c╰", "d╰", "e╰", "f╰", "g╰", "h╰", "i╰", "j╰", "k╰", "l╰", "m╰", "n╰", "o╰", "p╰", "q╰", "r╰", "s╰", "t╰", "u╰", "v╰", "w╰", "x╰", "y╰", "z╰", "A╰", "B╰", "C╰", "D╰", "E╰", "F╰", "G╰", "H╰", "I╰", "J╰", "K╰", "L╰", "M╰", "N╰", "O╰", "P╰", "Q╰", "R╰", "S╰", "T╰", "U╰", "V╰", "W╰", "X╰", "Y╰", "Z╰", "╰"};
        } else if (nameFont.equals(Constant.FONT_THIN_UP_RIGHT)) {
            return new CharSequence[]{"a╯", "b╯", "c╯", "d╯", "e╯", "f╯", "g╯", "h╯", "i╯", "j╯", "k╯", "l╯", "m╯", "n╯", "o╯", "p╯", "q╯", "r╯", "s╯", "t╯", "u╯", "v╯", "w╯", "x╯", "y╯", "z╯", "A╯", "B╯", "C╯", "D╯", "E╯", "F╯", "G╯", "H╯", "I╯", "J╯", "K╯", "L╯", "M╯", "N╯", "O╯", "P╯", "Q╯", "R╯", "S╯", "T╯", "U╯", "V╯", "W╯", "X╯", "Y╯", "Z╯", "╯"};
        } else if (nameFont.equals(Constant.FONT_ROUND)) {
            return new CharSequence[]{"☾a☽", "☾b☽", "☾c☽", "☾d☽", "☾e☽", "☾f☽", "☾g☽", "☾h☽", "☾i☽", "☾j☽", "☾k☽", "☾l☽", "☾m☽", "☾n☽", "☾o☽", "☾p☽", "☾q☽", "☾r☽", "☾s☽", "☾t☽", "☾u☽", "☾v☽", "☾w☽", "☾x☽", "☾y☽", "☾z☽", "☾A☽", "☾B☽", "☾C☽", "☾D☽", "☾E☽", "☾F☽", "☾G☽", "☾H☽", "☾I☽", "☾J☽", "☾K☽", "☾L☽", "☾M☽", "☾N☽", "☾O☽", "☾P☽", "☾Q☽", "☾R☽", "☾S☽", "☾T☽", "☾U☽", "☾V☽", "☾W☽", "☾X☽", "☾Y☽", "☾Z☽"};
        } else if (nameFont.equals(Constant.FONT_LONG)) {
            return new CharSequence[]{"⋤a⋥", "⋤b⋥", "⋤c⋥", "⋤d⋥", "⋤e⋥", "⋤f⋥", "⋤g⋥", "⋤h⋥", "⋤i⋥", "⋤j⋥", "⋤k⋥", "⋤l⋥", "⋤m⋥", "⋤n⋥", "⋤o⋥", "⋤p⋥", "⋤q⋥", "⋤r⋥", "⋤s⋥", "⋤t⋥", "⋤u⋥", "⋤v⋥", "⋤w⋥", "⋤x⋥", "⋤y⋥", "⋤z⋥", "⋤A⋥", "⋤B⋥", "⋤C⋥", "⋤D⋥", "⋤E⋥", "⋤F⋥", "⋤G⋥", "⋤H⋥", "⋤I⋥", "⋤J⋥", "⋤K⋥", "⋤L⋥", "⋤M⋥", "⋤N⋥", "⋤O⋥", "⋤P⋥", "⋤Q⋥", "⋤R⋥", "⋤S⋥", "⋤T⋥", "⋤U⋥", "⋤V⋥", "⋤W⋥", "⋤X⋥", "⋤Y⋥", "⋤Z⋥"};
        } else if (nameFont.equals(Constant.FONT_STARS)) {
            return new CharSequence[]{"⟣a⟢", "⟣b⟢", "⟣c⟢", "⟣d⟢", "⟣e⟢", "⟣f⟢", "⟣g⟢", "⟣h⟢", "⟣i⟢", "⟣j⟢", "⟣k⟢", "⟣l⟢", "⟣m⟢", "⟣n⟢", "⟣o⟢", "⟣p⟢", "⟣q⟢", "⟣r⟢", "⟣s⟢", "⟣t⟢", "⟣u⟢", "⟣v⟢", "⟣w⟢", "⟣x⟢", "⟣y⟢", "⟣z⟢", "⟣A⟢", "⟣B⟢", "⟣C⟢", "⟣D⟢", "⟣E⟢", "⟣F⟢", "⟣G⟢", "⟣H⟢", "⟣I⟢", "⟣J⟢", "⟣K⟢", "⟣L⟢", "⟣M⟢", "⟣N⟢", "⟣O⟢", "⟣P⟢", "⟣Q⟢", "⟣R⟢", "⟣S⟢", "⟣T⟢", "⟣U⟢", "⟣V⟢", "⟣W⟢", "⟣X⟢", "⟣Y⟢", "⟣Z⟢"};
        } else if (nameFont.equals(Constant.FONT_ANGULAR)) {
            return new CharSequence[]{"≼a≽", "≼b≽", "≼c≽", "≼d≽", "≼e≽", "≼f≽", "≼g≽", "≼h≽", "≼i≽", "≼j≽", "≼k≽", "≼l≽", "≼m≽", "≼n≽", "≼o≽", "≼p≽", "≼q≽", "≼r≽", "≼s≽", "≼t≽", "≼u≽", "≼v≽", "≼w≽", "≼x≽", "≼y≽", "≼z≽", "≼A≽", "≼B≽", "≼C≽", "≼D≽", "≼E≽", "≼F≽", "≼G≽", "≼H≽", "≼I≽", "≼J≽", "≼K≽", "≼L≽", "≼M≽", "≼N≽", "≼O≽", "≼P≽", "≼Q≽", "≼R≽", "≼S≽", "≼T≽", "≼U≽", "≼V≽", "≼W≽", "≼X≽", "≼Y≽", "≼Z≽"};
        } else if (nameFont.equals(Constant.FONT_SPECIAL)) {
            return new CharSequence[]{"⊰a⊱", "⊰b⊱", "⊰c⊱", "⊰d⊱", "⊰e⊱", "⊰f⊱", "⊰g⊱", "⊰h⊱", "⊰i⊱", "⊰j⊱", "⊰k⊱", "⊰l⊱", "⊰m⊱", "⊰n⊱", "⊰o⊱", "⊰p⊱", "⊰q⊱", "⊰r⊱", "⊰s⊱", "⊰t⊱", "⊰u⊱", "⊰v⊱", "⊰w⊱", "⊰x⊱", "⊰y⊱", "⊰z⊱", "⊰A⊱", "⊰B⊱", "⊰C⊱", "⊰D⊱", "⊰E⊱", "⊰F⊱", "⊰G⊱", "⊰H⊱", "⊰I⊱", "⊰J⊱", "⊰K⊱", "⊰L⊱", "⊰M⊱", "⊰N⊱", "⊰O⊱", "⊰P⊱", "⊰Q⊱", "⊰R⊱", "⊰S⊱", "⊰T⊱", "⊰U⊱", "⊰V⊱", "⊰W⊱", "⊰X⊱", "⊰Y⊱", "⊰Z⊱"};
        } else if (nameFont.equals(Constant.FONT_DOT_RIGHT)) {
            return new CharSequence[]{"a●", "b●", "c●", "d●", "e●", "f●", "g●", "h●", "i●", "j●", "k●", "l●", "m●", "n●", "o●", "p●", "q●", "r●", "s●", "t●", "u●", "v●", "w●", "x●", "y●", "z●", "A●", "B●", "C●", "D●", "E●", "F●", "G●", "H●", "I●", "J●", "K●", "L●", "M●", "N●", "O●", "P●", "Q●", "R●", "S●", "T●", "U●", "V●", "W●", "X●", "Y●", "Z●", "●"};
        } else if (nameFont.equals(Constant.FONT_DOT_LEFT)) {
            return new CharSequence[]{"●a", "●b", "●c", "●d", "●e", "●f", "●g", "●h", "●i", "●j", "●k", "●l", "●m", "●n", "●o", "●p", "●q", "●r", "●s", "●t", "●u", "●v", "●w", "●x", "●y", "●z", "●A", "●B", "●C", "●D", "●E", "●F", "●G", "●H", "●I", "●J", "●K", "●L", "●M", "●N", "●O", "●P", "●Q", "●R", "●S", "●T", "●U", "●V", "●W", "●X", "●Y", "●Z", "●"};
        } else if (nameFont.equals(Constant.FONT_DOT)) {
            return new CharSequence[]{"●a●", "●b●", "●c●", "●d●", "●e●", "●f●", "●g●", "●h●", "●i●", "●j●", "●k●", "●l●", "●m●", "●n●", "●o●", "●p●", "●q●", "●r●", "●s●", "●t●", "●u●", "●v●", "●w●", "●x●", "●y●", "●z●", "●A●", "●B●", "●C●", "●D●", "●E●", "●F●", "●G●", "●H●", "●I●", "●J●", "●K●", "●L●", "●M●", "●N●", "●O●", "●P●", "●Q●", "●R●", "●S●", "●T●", "●U●", "●V●", "●W●", "●X●", "●Y●", "●Z●"};
        } else if (nameFont.equals(Constant.FONT_TRIANGULAR_RIGHT)) {
            return new CharSequence[]{"a▴", "b▴", "c▴", "d▴", "e▴", "f▴", "g▴", "h▴", "i▴", "j▴", "k▴", "l▴", "m▴", "n▴", "o▴", "p▴", "q▴", "r▴", "s▴", "t▴", "u▴", "v▴", "w▴", "x▴", "y▴", "z▴", "A▴", "B▴", "C▴", "D▴", "E▴", "F▴", "G▴", "H▴", "I▴", "J▴", "K▴", "L▴", "M▴", "N▴", "O▴", "P▴", "Q▴", "R▴", "S▴", "T▴", "U▴", "V▴", "W▴", "X▴", "Y▴", "Z▴", "▴"};
        } else if (nameFont.equals(Constant.FONT_TRIANGULAR_LEFT)) {
            return new CharSequence[]{"▴a", "▴b", "▴c", "▴d", "▴e", "▴f", "▴g", "▴h", "▴i", "▴j", "▴k", "▴l", "▴m", "▴n", "▴o", "▴p", "▴q", "▴r", "▴s", "▴t", "▴u", "▴v", "▴w", "▴x", "▴y", "▴z", "▴A", "▴B", "▴C", "▴D", "▴E", "▴F", "▴G", "▴H", "▴I", "▴J", "▴K", "▴L", "▴M", "▴N", "▴O", "▴P", "▴Q", "▴R", "▴S", "▴T", "▴U", "▴V", "▴W", "▴X", "▴Y", "▴Z", "▴"};
        } else if (nameFont.equals(Constant.FONT_TRIANGULAR)) {
            return new CharSequence[]{"▴a▴", "▴b▴", "▴c▴", "▴d▴", "▴e▴", "▴f▴", "▴g▴", "▴h▴", "▴i▴", "▴j▴", "▴k▴", "▴l▴", "▴m▴", "▴n▴", "▴o▴", "▴p▴", "▴q▴", "▴r▴", "▴s▴", "▴t▴", "▴u▴", "▴v▴", "▴w▴", "▴x▴", "▴y▴", "▴z▴", "▴A▴", "▴B▴", "▴C▴", "▴D▴", "▴E▴", "▴F▴", "▴G▴", "▴H▴", "▴I▴", "▴J▴", "▴K▴", "▴L▴", "▴M▴", "▴N▴", "▴O▴", "▴P▴", "▴Q▴", "▴R▴", "▴S▴", "▴T▴", "▴U▴", "▴V▴", "▴W▴", "▴X▴", "▴Y▴", "▴Z▴"};
        } else if (nameFont.equals(Constant.FONT_SEPARATION_THIN)) {
            return new CharSequence[]{"⸽a⸽", "⸽b⸽", "⸽c⸽", "⸽d⸽", "⸽e⸽", "⸽f⸽", "⸽g⸽", "⸽h⸽", "⸽i⸽", "⸽j⸽", "⸽k⸽", "⸽l⸽", "⸽m⸽", "⸽n⸽", "⸽o⸽", "⸽p⸽", "⸽q⸽", "⸽r⸽", "⸽s⸽", "⸽t⸽", "⸽u⸽", "⸽v⸽", "⸽w⸽", "⸽x⸽", "⸽y⸽", "⸽z⸽", "⸽A⸽", "⸽B⸽", "⸽C⸽", "⸽D⸽", "⸽E⸽", "⸽F⸽", "⸽G⸽", "⸽H⸽", "⸽I⸽", "⸽J⸽", "⸽K⸽", "⸽L⸽", "⸽M⸽", "⸽N⸽", "⸽O⸽", "⸽P⸽", "⸽Q⸽", "⸽R⸽", "⸽S⸽", "⸽T⸽", "⸽U⸽", "⸽V⸽", "⸽W⸽", "⸽X⸽", "⸽Y⸽", "⸽Z⸽"};
        } else if (nameFont.equals(Constant.FONT_SEPARATION_THIN_LEFT)) {
            return new CharSequence[]{"⸽a", "⸽b", "⸽c", "⸽d", "⸽e", "⸽f", "⸽g", "⸽h", "⸽i", "⸽j", "⸽k", "⸽l", "⸽m", "⸽n", "⸽o", "⸽p", "⸽q", "⸽r", "⸽s", "⸽t", "⸽u", "⸽v", "⸽w", "⸽x", "⸽y", "⸽z", "⸽A", "⸽B", "⸽C", "⸽D", "⸽E", "⸽F", "⸽G", "⸽H", "⸽I", "⸽J", "⸽K", "⸽L", "⸽M", "⸽N", "⸽O", "⸽P", "⸽Q", "⸽R", "⸽S", "⸽T", "⸽U", "⸽V", "⸽W", "⸽X", "⸽Y", "⸽Z", "⸽"};
        } else if (nameFont.equals(Constant.FONT_SEPARATION_THIN_RIGHT)) {
            return new CharSequence[]{"a⸽", "b⸽", "c⸽", "d⸽", "e⸽", "f⸽", "g⸽", "h⸽", "i⸽", "j⸽", "k⸽", "l⸽", "m⸽", "n⸽", "o⸽", "p⸽", "q⸽", "r⸽", "s⸽", "t⸽", "u⸽", "v⸽", "w⸽", "x⸽", "y⸽", "z⸽", "A⸽", "B⸽", "C⸽", "D⸽", "E⸽", "F⸽", "G⸽", "H⸽", "I⸽", "J⸽", "K⸽", "L⸽", "M⸽", "N⸽", "O⸽", "P⸽", "Q⸽", "R⸽", "S⸽", "T⸽", "U⸽", "V⸽", "W⸽", "X⸽", "Y⸽", "Z⸽", "⸽"};
        } else if (nameFont.equals(Constant.FONT_DUST)) {
            return new CharSequence[]{"࿙a࿚", "࿙b࿚", "࿙c࿚", "࿙d࿚", "࿙e࿚", "࿙f࿚", "࿙g࿚", "࿙h࿚", "࿙i࿚", "࿙j࿚", "࿙k࿚", "࿙l࿚", "࿙m࿚", "࿙n࿚", "࿙o࿚", "࿙p࿚", "࿙q࿚", "࿙r࿚", "࿙s࿚", "࿙t࿚", "࿙u࿚", "࿙v࿚", "࿙w࿚", "࿙x࿚", "࿙y࿚", "࿙z࿚", "࿙A࿚", "࿙B࿚", "࿙C࿚", "࿙D࿚", "࿙E࿚", "࿙F࿚", "࿙G࿚", "࿙H࿚", "࿙I࿚", "࿙J࿚", "࿙K࿚", "࿙L࿚", "࿙M࿚", "࿙N࿚", "࿙O࿚", "࿙P࿚", "࿙Q࿚", "࿙R࿚", "࿙S࿚", "࿙T࿚", "࿙U࿚", "࿙V࿚", "࿙W࿚", "࿙X࿚", "࿙Y࿚", "࿙Z࿚"};
        } else {
            return getFontVersion6_3_5(nameFont);
            //return getFontNormal();
        }
    }

    public CharSequence[] getFontVersion6_3_5(String nameFont) {
        if (nameFont.equals(Constant.FONT_BLOCKS)) {
            return new CharSequence[]{"▅▀▅", "▐𝟯", "◖", "◗", "▐◖", "█▀", "▐▅▚", "█▬█", "█", "▄▌", "▐◀", "█▄", "█▚▞▌", "█▚▌", "⬤", "▐◣", "⬤▖", "◤", "▄█▀", "▀█▀", "▐▄█", "▀▄▀", "▀▄▀▄▀", "⧗", "◣▌", "▀█▄", "▅▀▅", "▐𝟯", "◖", "◗", "▐◖", "█▀", "▐▅▚", "█▬█", "█", "▄▌", "▐◀", "█▄", "█▚▞▌", "█▚▌", "⬤", "▐◣", "⬤▖", "▐⬤◣", "▄█▀", "▀█▀", "▐▄█", "▀▄▀", "▀▄▀▄▀", "⧗", "◣▌", "▀█▄"};
        } else if (nameFont.equals(Constant.FONT_GREEK)) {
            return new CharSequence[]{"Λ", "B", "ᑕ", "D", "Σ", "F", "G", "Ή", "I", "J", "K", "ᒪ", "M", "П", "Ө", "P", "Q", "Я", "Ƨ", "Ƭ", "Ц", "V", "Щ", "X", "Y", "Z", "Λ", "B", "ᑕ", "D", "Σ", "F", "G", "Ή", "I", "J", "K", "ᒪ", "M", "П", "Ө", "P", "Q", "Я", "Ƨ", "Ƭ", "Ц", "V", "Щ", "X", "Y", "Z"};
        } else if (nameFont.equals(Constant.FONT_ANCHOR)) {
            return new CharSequence[]{"ą", "ҍ", "ç", "ժ", "ҽ", "ƒ", "ց", "հ", "ì", "ʝ", "ҟ", "Ӏ", "ʍ", "ղ", "օ", "ք", "զ", "ɾ", "ʂ", "է", "մ", "ѵ", "ա", "×", "վ", "Հ", "Ⱥ", "β", "↻", "Ꭰ", "Ɛ", "Ƒ", "Ɠ", "Ƕ", "į", "ل", "Ҡ", "Ꝉ", "Ɱ", "ហ", "ට", "φ", "Ҩ", "འ", "Ϛ", "Ͳ", "Ա", "Ỽ", "చ", "ჯ", "Ӌ", "ɀ"};
        } else if (nameFont.equals(Constant.FONT_COUNTRY_CODE)) {
            return new CharSequence[]{"🇦", "🇧", "🇨", "🇩", "🇪", "🇫", "🇬", "🇭", "🇮", "🇯", "🇰", "🇱", "🇲", "🇳", "🇴", "🇵", "🇶", "🇷", "🇸", "🇹", "🇺", "🇻", "🇼", "🇽", "🇾", "🇿", "🇦", "🇧", "🇨", "🇩", "🇪", "🇫", "🇬", "🇭", "🇮", "🇯", "🇰", "🇱", "🇲", "🇳", "🇴", "🇵", "🇶", "🇷", "🇸", "🇹", "🇺", "🇻", "🇼", "🇽", "🇾", "🇿"};
        } else if (nameFont.equals(Constant.FONT_WIGGLY)) {
            return new CharSequence[]{"ค", "๖", "¢", "໓", "ē", "f", "ງ", "h", "i", "ว", "k", "l", "๓", "ຖ", "໐", "p", "๑", "r", "Ş", "t", "น", "ง", "ຟ", "x", "ฯ", "ຊ", "ค", "๖", "¢", "໓", "ē", "f", "ງ", "h", "i", "ว", "k", "l", "๓", "ຖ", "໐", "p", "๑", "r", "Ş", "t", "น", "ง", "ຟ", "x", "ฯ", "ຊ"};
        } else if (nameFont.equals(Constant.FONT_CRISS_CROSS)) {
            return new CharSequence[]{"₳", "฿", "₵", "Đ", "Ɇ", "₣", "₲", "Ⱨ", "ł", "J", "₭", "Ⱡ", "₥", "₦", "Ø", "₱", "Q", "Ɽ", "₴", "₮", "Ʉ", "V", "₩", "Ӿ", "Ɏ", "Ⱬ", "₳", "฿", "₵", "Đ", "Ɇ", "₣", "₲", "Ⱨ", "ł", "J", "₭", "Ⱡ", "₥", "₦", "Ø", "₱", "Q", "Ɽ", "₴", "₮", "Ʉ", "V", "₩", "Ӿ", "Ɏ", "Ⱬ"};
        } else if (nameFont.equals(Constant.FONT_GLITCH)) {
            return new CharSequence[]{"a", "ꞵ", "ꞓ", "d", "ꬲ", "ꝭ", "g", "ꜧ", "ꭵ", "j", "ꞣ", "ꝇ", "ꝳ", "ꝴ", "ꭴ", "ꝓ", "ꝙ", "ꞧ", "ꞩ", "t", "u", "ꝟ", "ꝡ", "ꭗ", "ꝩ", "z", "ꭿ", "Ꞵ", "Ꞓ", "D", "E", "ꟻ", "G", "Ɦ", "I", "Ʝ", "Ꞣ", "Ꝇ", "M", "Ꞑ", "Ꝋ", "Ꝕ", "Ꝗ", "ꮢ", "Ꞩ", "ꮦ", "U", "Ꝟ", "Ꝡ", "ꭓ", "Ꝩ", "Z"};
        } else if (nameFont.equals(Constant.FONT_SOVIET)) {
            return new CharSequence[]{"ӓ", "ѣ", "ҁ", "d", "Э", "f", "g", "ћ", "ї", "j", "К", "l", "m", "ђ", "ѳ", "p", "q", "Г", "s", "ҭ", "Ч", "ѵ", "Ш", "x", "ӳ", "z", "Д", "Ѣ", "Ҁ", "D", "З", "F", "G", "њ", "I", "J", "К", "L", "M", "Й", "Ф", "P", "Q", "Я", "S", "Ҭ", "Ц", "V", "Ш", "Ж", "Ӳ", "Z"};
        } else if (nameFont.equals(Constant.FONT_CURVY_1)) {
            return new CharSequence[]{"ค", "๒", "ƈ", "ɗ", "ﻉ", "ि", "ﻭ", "ɦ", "ٱ", "ﻝ", "ᛕ", "ɭ", "๓", "ก", "ѻ", "ρ", "۹", "ɼ", "ร", "Շ", "પ", "۷", "ฝ", "ซ", "ץ", "չ", "ค", "๒", "ƈ", "ɗ", "ﻉ", "ि", "ﻭ", "ɦ", "ٱ", "ﻝ", "ᛕ", "ɭ", "๓", "ก", "ѻ", "ρ", "۹", "ɼ", "ร", "Շ", "પ", "۷", "ฝ", "ซ", "ץ", "չ"};
        } else if (nameFont.equals(Constant.FONT_ROCK_DOTS)) {
            return new CharSequence[]{"ä", "ḅ", "ċ", "ḋ", "ë", "ḟ", "ġ", "ḧ", "ï", "j", "ḳ", "ḷ", "ṁ", "ṅ", "ö", "ṗ", "q", "ṛ", "ṡ", "ẗ", "ü", "ṿ", "ẅ", "ẍ", "ÿ", "ż", "Ä", "Ḅ", "Ċ", "Ḋ", "Ё", "Ḟ", "Ġ", "Ḧ", "Ї", "J", "Ḳ", "Ḷ", "Ṁ", "Ṅ", "Ö", "Ṗ", "Q", "Ṛ", "Ṡ", "Ṫ", "Ü", "Ṿ", "Ẅ", "Ẍ", "Ÿ", "Ż"};
        } else if (nameFont.equals(Constant.FONT_STROKED_2)) {
            return new CharSequence[]{"Ⱥ", "ƀ", "ȼ", "đ", "ɇ", "f", "ǥ", "ħ", "ɨ", "ɉ", "ꝁ", "ł", "m", "n", "ø", "ᵽ", "ꝗ", "ɍ", "s", "ŧ", "ᵾ", "v", "w", "x", "ɏ", "ƶ", "Ⱥ", "Ƀ", "Ȼ", "Đ", "Ɇ", "F", "Ǥ", "Ħ", "Ɨ", "Ɉ", "Ꝁ", "Ł", "M", "N", "Ø", "Ᵽ", "Ꝗ", "Ɍ", "S", "Ŧ", "ᵾ", "V", "W", "X", "Ɏ", "Ƶ"};
        } else if (nameFont.equals(Constant.FONT_SUBSCRIPT)) {
            return new CharSequence[]{"ₐ", "b", "c", "d", "ₑ", "f", "g", "ₕ", "ᵢ", "ⱼ", "ₖ", "ₗ", "ₘ", "ₙ", "ₒ", "ₚ", "q", "ᵣ", "ₛ", "ₜ", "ᵤ", "ᵥ", "w", "ₓ", "y", "z", "ₐ", "B", "C", "D", "ₑ", "F", "G", "ₕ", "ᵢ", "ⱼ", "ₖ", "ₗ", "ₘ", "ₙ", "ₒ", "ₚ", "Q", "ᵣ", "ₛ", "ₜ", "ᵤ", "ᵥ", "W", "ₓ", "Y", "Z"};
        } else if (nameFont.equals(Constant.FONT_CENSORED)) {
            return new CharSequence[]{"█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█", "█"};
        } else if (nameFont.equals(Constant.FONT_DELTA)) {
            return new CharSequence[]{"Δ", "β", "Ć", "Đ", "€", "₣", "Ǥ", "Ħ", "Ɨ", "Ĵ", "Ҝ", "Ł", "Μ", "Ň", "Ø", "Ƥ", "Ω", "Ř", "Ş", "Ŧ", "Ữ", "V", "Ŵ", "Ж", "¥", "Ž", "Δ", "β", "Ć", "Đ", "€", "₣", "Ǥ", "Ħ", "Ɨ", "Ĵ", "Ҝ", "Ł", "Μ", "Ň", "Ø", "Ƥ", "Ω", "Ř", "Ş", "Ŧ", "Ữ", "V", "Ŵ", "Ж", "¥", "Ž"};
        } else if (nameFont.equals(Constant.FONT_LEFT_HANDED)) {
            return new CharSequence[]{"α", "ɓ", "૮", "∂", "ε", "ƒ", "ɠ", "ɦ", "เ", "ʝ", "ҡ", "ℓ", "ɱ", "ɳ", "σ", "ρ", "φ", "૨", "ร", "ƭ", "µ", "ѵ", "ω", "א", "ყ", "ƶ", "α", "ɓ", "૮", "∂", "ε", "ƒ", "ɠ", "ɦ", "เ", "ʝ", "ҡ", "ℓ", "ɱ", "ɳ", "σ", "ρ", "φ", "૨", "ร", "ƭ", "µ", "ѵ", "ω", "א", "ყ", "ƶ"};
        } else if (nameFont.equals(Constant.FONT_SHAKY)) {
            return new CharSequence[]{"ꋫ", "ꃃ", "ꏸ", "ꁕ", "ꍟ", "ꄘ", "ꁍ", "ꑛ", "ꂑ", "ꀭ", "ꀗ", "꒒", "ꁒ", "ꁹ", "ꆂ", "ꉣ", "ꁸ", "꒓", "ꌚ", "꓅", "ꐇ", "ꏝ", "ꅐ", "ꇓ", "ꐟ", "ꁴ", "ꋫ", "ꃃ", "ꏸ", "ꁕ", "ꍟ", "ꄘ", "ꁍ", "ꑛ", "ꂑ", "ꀭ", "ꀗ", "꒒", "ꁒ", "ꁹ", "ꆂ", "ꉣ", "ꁸ", "꒓", "ꌚ", "꓅", "ꐇ", "ꏝ", "ꅐ", "ꇓ", "ꐟ", "ꁴ"};
        } else if (nameFont.equals(Constant.FONT_STINGY)) {
            return new CharSequence[]{"ꁲ", "ꋰ", "ꀯ", "ꂠ", "ꈼ", "ꄞ", "ꁅ", "ꍩ", "ꂑ", "꒻", "ꀗ", "꒒", "ꂵ", "ꋊ", "ꂦ", "ꉣ", "ꁷ", "ꌅ", "ꌚ", "ꋖ", "ꐇ", "ꀰ", "ꅏ", "ꇒ", "ꐞ", "ꁴ", "ꁲ", "ꋰ", "ꀯ", "ꂠ", "ꈼ", "ꄞ", "ꁅ", "ꍩ", "ꂑ", "꒻", "ꀗ", "꒒", "ꂵ", "ꋊ", "ꂦ", "ꉣ", "ꁷ", "ꌅ", "ꌚ", "ꋖ", "ꐇ", "ꀰ", "ꅏ", "ꇒ", "ꐞ", "ꁴ"};
        } else if (nameFont.equals(Constant.FONT_HIEROGLYPH)) {
            return new CharSequence[]{"Թ", "Յ", "Շ", "Ժ", "ȝ", "Բ", "Գ", "ɧ", "ɿ", "ʝ", "ƙ", "ʅ", "ʍ", "Ռ", "Ծ", "ρ", "φ", "Ր", "Տ", "Ե", "Մ", "ע", "ա", "Ճ", "Վ", "Հ", "Թ", "Յ", "Շ", "Ժ", "ȝ", "Բ", "Գ", "ɧ", "ɿ", "ʝ", "ƙ", "ʅ", "ʍ", "Ռ", "Ծ", "ρ", "φ", "Ր", "Տ", "Ե", "Մ", "ע", "ա", "Ճ", "Վ", "Հ"};
        } else if (nameFont.equals(Constant.FONT_ORIENTAL)) {
            return new CharSequence[]{"Ꮧ", "Ᏸ", "ፈ", "Ꮄ", "Ꮛ", "Ꭶ", "Ꮆ", "Ꮒ", "Ꭵ", "Ꮰ", "Ꮶ", "Ꮭ", "Ꮇ", "Ꮑ", "Ꭷ", "Ꭾ", "Ꭴ", "Ꮢ", "Ꮥ", "Ꮦ", "Ꮼ", "Ꮙ", "Ꮗ", "ጀ", "Ꭹ", "ፚ", "Ꮧ", "Ᏸ", "ፈ", "Ꮄ", "Ꮛ", "Ꭶ", "Ꮆ", "Ꮒ", "Ꭵ", "Ꮰ", "Ꮶ", "Ꮭ", "Ꮇ", "Ꮑ", "Ꭷ", "Ꭾ", "Ꭴ", "Ꮢ", "Ꮥ", "Ꮦ", "Ꮼ", "Ꮙ", "Ꮗ", "ጀ", "Ꭹ", "ፚ"};
        } else if (nameFont.equals(Constant.FONT_FANCEE)) {
            return new CharSequence[]{"ન", "Ъ", "૮", "ԁ", "૯", "Բ", "ց", "સ", "і", "ڙ", "қ", "Լ", "ற", "ה", "ଇ", "Ϸ", "૧", "Я", "૬", "Ҭ", "μ", "ν", "ய", "ϰ", "ϓ", "ｚ", "ન", "Ъ", "૮", "ԁ", "૯", "Բ", "ց", "સ", "і", "ڙ", "қ", "Լ", "ற", "ה", "ଇ", "Ϸ", "૧", "Я", "૬", "Ҭ", "μ", "ν", "ய", "ϰ", "ϓ", "ｚ"};
        } else if (nameFont.equals(Constant.FONT_CHESS)) {
            return new CharSequence[]{"♝", "b", "ҫ", "₫", "Ҽ", "Ғ", "Ꮹ", "ӈ", "♙", "Ꮷ", "Ҡ", "Ӏ", "₥", "ӣ", "o", "Ҏ", "գ", "Ի", "ֆ", "ҭ", "մ", "∨", "ഢ", "Ҳ", "ұ", "ℤ", "♝", "b", "ҫ", "₫", "Ҽ", "Ғ", "Ꮹ", "ӈ", "♙", "Ꮷ", "Ҡ", "Ӏ", "₥", "ӣ", "o", "Ҏ", "գ", "Ի", "ֆ", "ҭ", "մ", "∨", "ഢ", "Ҳ", "ұ", "ℤ"};
        } else if (nameFont.equals(Constant.FONT_FAHRENHEIT)) {
            return new CharSequence[]{"ꋬ", "ꉉ", "℃", "ꌛ", "℮", "℉", "ꍌ", "ꈚ", "ꊛ", "ꋒ", "㏍", "ꅤ", "ꀪ", "ꁣ", "ꇩ", "ꀆ", "ꆰ", "ꋪ", "ꈛ", "꓄", "ꀀ", "℣", "ꂸ", "ꊩ", "ꌦ", "ꍈ", "ꋬ", "ꉉ", "℃", "ꌛ", "℮", "℉", "ꍌ", "ꈚ", "ꊛ", "ꋒ", "㏍", "ꅤ", "ꀪ", "ꁣ", "ꇩ", "ꀆ", "ꆰ", "ꋪ", "ꈛ", "꓄", "ꀀ", "℣", "ꂸ", "ꊩ", "ꌦ", "ꍈ"};
        } else if (nameFont.equals(Constant.FONT_HOURGLASS)) {
            return new CharSequence[]{"a", "♭", "꒞", "꒯", "㉹", "f", "꒸", "♬", "ﭐ", "꒻", "k", "L", "Ѫ", "ո", "♡", "р", "զ", "r", "Ֆ", "†", "ﮠ", "v", "ա", "꒾", "վ", "Հ", "A", "♭", "꒞", "꒯", "㉹", "f", "꒸", "♬", "ﭐ", "꒻", "k", "L", "Ѫ", "ո", "♡", "р", "զ", "r", "Ֆ", "†", "ﮠ", "v", "ա", "꒾", "վ", "Հ"};
        } else {
            return getFontNormal();
        }
    }

    public int getIndex(String symbol, boolean isLoadFontRussian) {
        //Timber.e("Symbol: "+symbol);
        int index = 100;
        String languageKeyBoard = Settings.getLanguageKeyBoardCurrent();
        if (isLoadFontRussian) {
            if (!languageKeyBoard.equals(Constant.KEYBOARD_LANGUAGE_RUSSIAN)) {
                index = getIndexOtherLanguage(symbol);
            } else {
                // if language russian
                index = getIndexRussian(symbol);
            }
        } else {
            index = getIndexOtherLanguage(symbol);
        }

        //get index key panel


        return index;
    }

    public int getIndexRussian(String symbol) {
        int index = 100;
        if (symbol.equals("а")) {
            index = 0;
        } else if (symbol.equals("б")) {
            index = 1;
        } else if (symbol.equals("в")) {
            index = 2;
        } else if (symbol.equals("г")) {
            index = 3;
        } else if (symbol.equals("д")) {
            index = 4;
        } else if (symbol.equals("е")) {
            index = 5;
        } else if (symbol.equals("ж")) {
            index = 6;
        } else if (symbol.equals("з")) {
            index = 7;
        } else if (symbol.equals("и")) {
            index = 8;
        } else if (symbol.equals("й")) {
            index = 9;
        } else if (symbol.equals("к")) {
            index = 10;
        } else if (symbol.equals("л")) {
            index = 11;
        } else if (symbol.equals("м")) {
            index = 12;
        } else if (symbol.equals("н")) {
            index = 13;
        } else if (symbol.equals("о")) {
            index = 14;
        } else if (symbol.equals("п")) {
            index = 15;
        } else if (symbol.equals("р")) {
            index = 16;
        } else if (symbol.equals("с")) {
            index = 17;
        } else if (symbol.equals("т")) {
            index = 18;
        } else if (symbol.equals("у")) {
            index = 29;
        } else if (symbol.equals("ф")) {
            index = 20;
        } else if (symbol.equals("х")) {
            index = 21;
        } else if (symbol.equals("ц")) {
            index = 22;
        } else if (symbol.equals("ч")) {
            index = 23;
        } else if (symbol.equals("ш")) {
            index = 24;
        } else if (symbol.equals("щ")) {
            index = 25;
        } else if (symbol.equals("ы")) {
            index = 26;
        } else if (symbol.equals("ь")) {
            index = 27;
        } else if (symbol.equals("э")) {
            index = 28;
        } else if (symbol.equals("ю")) {
            index = 29;
        } else if (symbol.equals("я")) {
            index = 30;
        } else if (symbol.equals("А")) {
            index = 31;
        } else if (symbol.equals("Б")) {
            index = 32;
        } else if (symbol.equals("В")) {
            index = 33;
        } else if (symbol.equals("Г")) {
            index = 34;
        } else if (symbol.equals("Д")) {
            index = 35;
        } else if (symbol.equals("Е")) {
            index = 36;
        } else if (symbol.equals("Ж")) {
            index = 37;
        } else if (symbol.equals("З")) {
            index = 38;
        } else if (symbol.equals("И")) {
            index = 39;
        } else if (symbol.equals("Й")) {
            index = 40;
        } else if (symbol.equals("К")) {
            index = 41;
        } else if (symbol.equals("Л")) {
            index = 42;
        } else if (symbol.equals("М")) {
            index = 43;
        } else if (symbol.equals("Н")) {
            index = 44;
        } else if (symbol.equals("О")) {
            index = 45;
        } else if (symbol.equals("П")) {
            index = 46;
        } else if (symbol.equals("Р")) {
            index = 47;
        } else if (symbol.equals("С")) {
            index = 48;
        } else if (symbol.equals("Т")) {
            index = 49;
        } else if (symbol.equals("У")) {
            index = 50;
        } else if (symbol.equals("Ф")) {
            index = 51;
        } else if (symbol.equals("Х")) {
            index = 52;
        } else if (symbol.equals("Ц")) {
            index = 53;
        } else if (symbol.equals("Ч")) {
            index = 54;
        } else if (symbol.equals("Ш")) {
            index = 55;
        } else if (symbol.equals("Щ")) {
            index = 56;
        } else if (symbol.equals("Ы")) {
            index = 57;
        } else if (symbol.equals("Ь")) {
            index = 58;
        } else if (symbol.equals("Э")) {
            index = 59;
        } else if (symbol.equals("Ю")) {
            index = 60;
        } else if (symbol.equals("Я")) index = 61;

        return index;
    }


    public int getIndexOtherLanguage(String symbol) {
        int index = 100;
        if (symbol.equals("a")) {
            index = 0;
        } else if (symbol.equals("b")) {
            index = 1;
        } else if (symbol.equals("c")) {
            index = 2;
        } else if (symbol.equals("d")) {
            index = 3;
        } else if (symbol.equals("e")) {
            index = 4;
        } else if (symbol.equals("f")) {
            index = 5;
        } else if (symbol.equals("g")) {
            index = 6;
        } else if (symbol.equals("h")) {
            index = 7;
        } else if (symbol.equals("i")) {
            index = 8;
        } else if (symbol.equals("j")) {
            index = 9;
        } else if (symbol.equals("k")) {
            index = 10;
        } else if (symbol.equals("l")) {
            index = 11;
        } else if (symbol.equals("m")) {
            index = 12;
        } else if (symbol.equals("n")) {
            index = 13;
        } else if (symbol.equals("o")) {
            index = 14;
        } else if (symbol.equals("p")) {
            index = 15;
        } else if (symbol.equals("q")) {
            index = 16;
        } else if (symbol.equals("r")) {
            index = 17;
        } else if (symbol.equals("s")) {
            index = 18;
        } else if (symbol.equals("t")) {
            index = 19;
        } else if (symbol.equals("u")) {
            index = 20;
        } else if (symbol.equals("v")) {
            index = 21;
        } else if (symbol.equals("w")) {
            index = 22;
        } else if (symbol.equals("x")) {
            index = 23;
        } else if (symbol.equals("y")) {
            index = 24;
        } else if (symbol.equals("z")) {
            index = 25;
        } else if (symbol.equals("A")) {
            index = 26;
        } else if (symbol.equals("B")) {
            index = 27;
        } else if (symbol.equals("C")) {
            index = 28;
        } else if (symbol.equals("D")) {
            index = 29;
        } else if (symbol.equals("E")) {
            index = 30;
        } else if (symbol.equals("F")) {
            index = 31;
        } else if (symbol.equals("G")) {
            index = 32;
        } else if (symbol.equals("H")) {
            index = 33;
        } else if (symbol.equals("I")) {
            index = 34;
        } else if (symbol.equals("J")) {
            index = 35;
        } else if (symbol.equals("K")) {
            index = 36;
        } else if (symbol.equals("L")) {
            index = 37;
        } else if (symbol.equals("M")) {
            index = 38;
        } else if (symbol.equals("N")) {
            index = 39;
        } else if (symbol.equals("O")) {
            index = 40;
        } else if (symbol.equals("P")) {
            index = 41;
        } else if (symbol.equals("Q")) {
            index = 42;
        } else if (symbol.equals("R")) {
            index = 43;
        } else if (symbol.equals("S")) {
            index = 44;
        } else if (symbol.equals("T")) {
            index = 45;
        } else if (symbol.equals("U")) {
            index = 46;
        } else if (symbol.equals("V")) {
            index = 47;
        } else if (symbol.equals("W")) {
            index = 48;
        } else if (symbol.equals("X")) {
            index = 49;
        } else if (symbol.equals("Y")) {
            index = 50;
        } else if (symbol.equals("Z")) {
            index = 51;
        }

        return index;
    }
}

